[NoCoverage] ArrayDeclaration
src/apartment/isURLOrImageFile.ts:41:31
         validationArguments?: ValidationArguments | undefined,
     ): Promise<boolean> {
         try {
-            await Promise.any([
-                validateOrReject(
-                    plainToInstance(ImageFileContainer, { value }),
-                ),
-                validateOrReject(plainToInstance(URLContainer, { value })),
-            ]);
+            await Promise.any([]);
             return true;
         } catch (error) {

[NoCoverage] ObjectLiteral
src/apartment/isURLOrImageFile.ts:43:57
         try {
             await Promise.any([
                 validateOrReject(
-                    plainToInstance(ImageFileContainer, { value }),
+                    plainToInstance(ImageFileContainer, {}),
                 ),
                 validateOrReject(plainToInstance(URLContainer, { value })),

[NoCoverage] BooleanLiteral
src/apartment/isURLOrImageFile.ts:47:20
                 ),
                 validateOrReject(plainToInstance(URLContainer, { value })),
             ]);
-            return true;
+            return false;
         } catch (error) {
             if (error instanceof AggregateError) {

[NoCoverage] BlockStatement
src/apartment/isURLOrImageFile.ts:49:50
             ]);
             return true;
         } catch (error) {
-            if (error instanceof AggregateError) {
-                throw new BadRequestException({
-                    message: `${validationArguments?.property} fail to validate any of the following constrains`,
-                    constraints: error.errors.reduce(
-                        (msg, err: ValidationError[]) => {
-                            msg.push(err[0].constraints);
-                            return msg;
-                        },
-                        [],
-                    ),
-                });
-            }
+            if (error instanceof AggregateError) {}
             throw new error();
         }

[NoCoverage] ConditionalExpression
src/apartment/isURLOrImageFile.ts:49:17
             ]);
             return true;
         } catch (error) {
-            if (error instanceof AggregateError) {
+            if (true) {
                 throw new BadRequestException({
                     message: `${validationArguments?.property} fail to validate any of the following constrains`,

[NoCoverage] StringLiteral
src/apartment/isURLOrImageFile.ts:51:30
         } catch (error) {
             if (error instanceof AggregateError) {
                 throw new BadRequestException({
-                    message: `${validationArguments?.property} fail to validate any of the following constrains`,
+                    message: ``,
                     constraints: error.errors.reduce(
                         (msg, err: ValidationError[]) => {

[NoCoverage] BlockStatement
src/apartment/isURLOrImageFile.ts:53:58
                 throw new BadRequestException({
                     message: `${validationArguments?.property} fail to validate any of the following constrains`,
                     constraints: error.errors.reduce(
-                        (msg, err: ValidationError[]) => {
-                            msg.push(err[0].constraints);
-                            return msg;
-                        },
+                        (msg, err: ValidationError[]) => {},
                         [],
                     ),
