[Timeout] BlockStatement
src/admin/admin.sub.ts:13:41
 
 @EventSubscriber()
 export class AdminSubscriber implements EntitySubscriberInterface<Admin> {
-    constructor(dataSource: DataSource) {
-        dataSource.subscribers.push(this);
-    }
+    constructor(dataSource: DataSource) {}
 
     listenTo() {

[NoCoverage] BlockStatement
src/admin/admin.sub.ts:31:59
     /**
      * Disable account when resident is sofr removed
      */
-    async beforeSoftRemove(event: SoftRemoveEvent<Admin>) {
-        if (event.entity)
-            await this.disableAccount(
-                event.entity,
-                event.manager.getRepository(Account),
-            );
-    }
+    async beforeSoftRemove(event: SoftRemoveEvent<Admin>) {}
 
     /**
