[Survived] BlockStatement
src/admin/admin.sub.ts:24:7
     private async disableAccount(
         admin: Admin,
         accountRepository: Repository<Account>,
-    ) {
-        if (admin.account) await accountRepository.softRemove(admin.account);
-    }
+    ) {}
 
     /**

[Survived] BlockStatement
src/admin/admin.sub.ts:42:55
     /**
      * Disable account when resident is removed
      */
-    async beforeRemove(event: SoftRemoveEvent<Admin>) {
-        if (event.entity)
-            await this.disableAccount(
-                event.entity,
-                event.manager.getRepository(Account),
-            );
-    }
+    async beforeRemove(event: SoftRemoveEvent<Admin>) {}
 }
 
