[NoCoverage] BlockStatement
src/avatar-generator/avatar-generator.service.ts:14:26
 {
     private createAvatar: any;
     private collection: any;
-    async onModuleInit() {
-        this.createAvatar = (await import("@dicebear/core")).createAvatar;
-        this.collection = await import("@dicebear/collection");
-    }
+    async onModuleInit() {}
     async generateAvatar(seed: any): Promise<ArrayBuffer> {
         return await this.createAvatar(
