[Timeout] StringLiteral
src/auth/auth.service.ts:43:60
         super();
     }
 
-    async signIn(signInDto: SignInDto, expiresIn: string = "30d") {
+    async signIn(signInDto: SignInDto, expiresIn: string = "") {
         let person = await this.findOwnerByAccountEmail(signInDto.email);
         console.log(person);

[Timeout] BooleanLiteral
src/auth/auth.service.ts:49:13
         if (
             !person ||
             !person.account ||
-            !this.hashService.isMatch(
-                signInDto.password,
-                person.account.password,
-            )
+            this.hashService.isMatch(signInDto.password, person.account.password)
         ) {
             throw new UnauthorizedException("Wrong email or password");

[Timeout] BooleanLiteral
src/auth/auth.service.ts:75:30
             where: { email },
             relations: {
                 admin: {
-                    account: true,
+                    account: false,
                 },
                 resident: {

[Timeout] BooleanLiteral
src/auth/auth.service.ts:78:30
                     account: true,
                 },
                 resident: {
-                    account: true,
+                    account: false,
                 },
                 technician: {

[Timeout] BooleanLiteral
src/auth/auth.service.ts:81:30
                     account: true,
                 },
                 technician: {
-                    account: true,
+                    account: false,
                 },
                 manager: {

[Timeout] BooleanLiteral
src/auth/auth.service.ts:84:30
                     account: true,
                 },
                 manager: {
-                    account: true,
+                    account: false,
                 },
             },

[Timeout] LogicalOperator
src/auth/auth.service.ts:92:13
         if (account === null) return null;
 
         else return (
-            account.resident ||
-            account.admin ||
+            account.resident && account.admin ||
             account.technician ||
             account.manager ||

[Timeout] LogicalOperator
src/auth/auth.service.ts:92:13
         if (account === null) return null;
 
         else return (
-            account.resident ||
-            account.admin ||
-            account.technician ||
-            account.manager ||
+            (account.resident || account.admin || account.technician) && account.manager ||
             null
         );

[Timeout] ObjectLiteral
src/auth/auth.service.ts:106:24
         const account = await this.accountRepository.findOne({
             where: { owner_id: id },
             relations: {
-                admin: {
-                    account: true,
-                },
+                admin: {},
                 resident: {
                     account: true,

[Timeout] ObjectLiteral
src/auth/auth.service.ts:112:29
                 resident: {
                     account: true,
                 },
-                technician: {
-                    account: true,
-                },
+                technician: {},
                 manager: {
                     account: true,

[Timeout] LogicalOperator
src/auth/auth.service.ts:124:13
         if (account === null) return null;
 
         return (
-            account.resident ||
-            account.admin ||
-            account.technician ||
-            account.manager ||
+            (account.resident || account.admin || account.technician) && account.manager ||
             null
         );

[Timeout] LogicalOperator
src/auth/auth.service.ts:124:13
         if (account === null) return null;
 
         return (
-            account.resident ||
-            account.admin ||
-            account.technician ||
+            (account.resident || account.admin) && account.technician ||
             account.manager ||
             null
