[NoCoverage] BlockStatement
src/helper/guard/role.guard.ts:19:43
             context.getHandler(),
             context.getClass(),
         ]);
-        if (!roles || roles.length === 0) {
-            return true;
-        }
+        if (!roles || roles.length === 0) {}
         const request = context.switchToHttp().getRequest();
         const user = request.user;

[NoCoverage] BooleanLiteral
src/helper/guard/role.guard.ts:20:20
             context.getClass(),
         ]);
         if (!roles || roles.length === 0) {
-            return true;
+            return false;
         }
         const request = context.switchToHttp().getRequest();

[NoCoverage] ArrowFunction
src/helper/guard/role.guard.ts:24:25
         }
         const request = context.switchToHttp().getRequest();
         const user = request.user;
-        const hasRole = () => roles.includes(user.role);
+        const hasRole = () => undefined;
         const hasAuthority = user && user.role && hasRole();
         if (hasAuthority) return true;

[NoCoverage] ConditionalExpression
src/helper/guard/role.guard.ts:25:30
         const request = context.switchToHttp().getRequest();
         const user = request.user;
         const hasRole = () => roles.includes(user.role);
-        const hasAuthority = user && user.role && hasRole();
+        const hasAuthority = false;
         if (hasAuthority) return true;
         throw new ForbiddenException(

[NoCoverage] StringLiteral
src/helper/guard/role.guard.ts:28:34
         const hasAuthority = user && user.role && hasRole();
         if (hasAuthority) return true;
         throw new ForbiddenException(
-            "Only " + roles.join(", ") + " have permission",
+            "Only " + roles.join("") + " have permission",
         );
     }
