[Timeout] BlockStatement
src/auth/guard/jwt-auth.guard.ts:27:44
     }
 
     async validateRequest(request: any): Promise<boolean> {
-        if (request.headers.authorization) {
-            const token = request.headers.authorization.split(" ")[1];
-            if (token) {
-                try {
-                    const payload: TokenPayload = this.jwtService.verify(token);
-                    const user = await this.authService.findOwnerById(
-                        payload.id,
-                    );
-                    if (!user) throw new UnauthorizedException("Token invalid");
-                    request.user = user;
-                    return true;
-                } catch (error) {
-                    if (error instanceof TokenExpiredError) {
-                        throw new UnauthorizedException("Token expired");
-                    } else if (error instanceof JsonWebTokenError) {
-                        throw new UnauthorizedException("Token invalid");
-                    }
-                    console.error(error);
-                    throw error;
-                }
-            }
-        }
+        if (request.headers.authorization) {}
         return false;
     }

[Timeout] ConditionalExpression
src/auth/guard/jwt-auth.guard.ts:27:13
     }
 
     async validateRequest(request: any): Promise<boolean> {
-        if (request.headers.authorization) {
+        if (true) {
             const token = request.headers.authorization.split(" ")[1];
             if (token) {

[Timeout] StringLiteral
src/auth/guard/jwt-auth.guard.ts:28:63
 
     async validateRequest(request: any): Promise<boolean> {
         if (request.headers.authorization) {
-            const token = request.headers.authorization.split(" ")[1];
+            const token = request.headers.authorization.split("")[1];
             if (token) {
                 try {

[Timeout] ConditionalExpression
src/auth/guard/jwt-auth.guard.ts:29:17
     async validateRequest(request: any): Promise<boolean> {
         if (request.headers.authorization) {
             const token = request.headers.authorization.split(" ")[1];
-            if (token) {
+            if (false) {
                 try {
                     const payload: TokenPayload = this.jwtService.verify(token);

[Timeout] BlockStatement
src/auth/guard/jwt-auth.guard.ts:29:24
     async validateRequest(request: any): Promise<boolean> {
         if (request.headers.authorization) {
             const token = request.headers.authorization.split(" ")[1];
-            if (token) {
-                try {
-                    const payload: TokenPayload = this.jwtService.verify(token);
-                    const user = await this.authService.findOwnerById(
-                        payload.id,
-                    );
-                    if (!user) throw new UnauthorizedException("Token invalid");
-                    request.user = user;
-                    return true;
-                } catch (error) {
-                    if (error instanceof TokenExpiredError) {
-                        throw new UnauthorizedException("Token expired");
-                    } else if (error instanceof JsonWebTokenError) {
-                        throw new UnauthorizedException("Token invalid");
-                    }
-                    console.error(error);
-                    throw error;
-                }
-            }
+            if (token) {}
         }
         return false;

[Timeout] BlockStatement
src/auth/guard/jwt-auth.guard.ts:30:21
         if (request.headers.authorization) {
             const token = request.headers.authorization.split(" ")[1];
             if (token) {
-                try {
-                    const payload: TokenPayload = this.jwtService.verify(token);
-                    const user = await this.authService.findOwnerById(
-                        payload.id,
-                    );
-                    if (!user) throw new UnauthorizedException("Token invalid");
-                    request.user = user;
-                    return true;
-                } catch (error) {
+                try {} catch (error) {
                     if (error instanceof TokenExpiredError) {
                         throw new UnauthorizedException("Token expired");

[Timeout] ConditionalExpression
src/auth/guard/jwt-auth.guard.ts:35:25
                     const user = await this.authService.findOwnerById(
                         payload.id,
                     );
-                    if (!user) throw new UnauthorizedException("Token invalid");
+                    if (false) throw new UnauthorizedException("Token invalid");
                     request.user = user;
                     return true;

[Timeout] BooleanLiteral
src/auth/guard/jwt-auth.guard.ts:35:25
                     const user = await this.authService.findOwnerById(
                         payload.id,
                     );
-                    if (!user) throw new UnauthorizedException("Token invalid");
+                    if (user) throw new UnauthorizedException("Token invalid");
                     request.user = user;
                     return true;

[Timeout] BooleanLiteral
src/auth/guard/jwt-auth.guard.ts:37:28
                     );
                     if (!user) throw new UnauthorizedException("Token invalid");
                     request.user = user;
-                    return true;
+                    return false;
                 } catch (error) {
                     if (error instanceof TokenExpiredError) {

[Timeout] BlockStatement
src/auth/guard/jwt-auth.guard.ts:38:33
                     if (!user) throw new UnauthorizedException("Token invalid");
                     request.user = user;
                     return true;
-                } catch (error) {
-                    if (error instanceof TokenExpiredError) {
-                        throw new UnauthorizedException("Token expired");
-                    } else if (error instanceof JsonWebTokenError) {
-                        throw new UnauthorizedException("Token invalid");
-                    }
-                    console.error(error);
-                    throw error;
-                }
+                } catch (error) {}
             }
         }

[Timeout] ConditionalExpression
src/auth/guard/jwt-auth.guard.ts:39:25
                     request.user = user;
                     return true;
                 } catch (error) {
-                    if (error instanceof TokenExpiredError) {
+                    if (true) {
                         throw new UnauthorizedException("Token expired");
                     } else if (error instanceof JsonWebTokenError) {

[Timeout] ConditionalExpression
src/auth/guard/jwt-auth.guard.ts:39:25
                     request.user = user;
                     return true;
                 } catch (error) {
-                    if (error instanceof TokenExpiredError) {
+                    if (false) {
                         throw new UnauthorizedException("Token expired");
                     } else if (error instanceof JsonWebTokenError) {

[Timeout] ConditionalExpression
src/auth/guard/jwt-auth.guard.ts:41:32
                 } catch (error) {
                     if (error instanceof TokenExpiredError) {
                         throw new UnauthorizedException("Token expired");
-                    } else if (error instanceof JsonWebTokenError) {
+                    } else if (false) {
                         throw new UnauthorizedException("Token invalid");
                     }

[Timeout] BlockStatement
src/auth/guard/jwt-auth.guard.ts:41:68
                 } catch (error) {
                     if (error instanceof TokenExpiredError) {
                         throw new UnauthorizedException("Token expired");
-                    } else if (error instanceof JsonWebTokenError) {
-                        throw new UnauthorizedException("Token invalid");
-                    }
+                    } else if (error instanceof JsonWebTokenError) {}
                     console.error(error);
                     throw error;

[Timeout] StringLiteral
src/auth/guard/jwt-auth.guard.ts:42:57
                     if (error instanceof TokenExpiredError) {
                         throw new UnauthorizedException("Token expired");
                     } else if (error instanceof JsonWebTokenError) {
-                        throw new UnauthorizedException("Token invalid");
+                        throw new UnauthorizedException("");
                     }
                     console.error(error);
