[Timeout] ConditionalExpression
src/employee/employee.service.ts:87:82
             const backPhoto = front_identify_card_photo as MemoryStoredFile;
             const frontURL = await this.storageManager.upload(
                 frontPhoto.buffer,
-                "employee/" + employee.id + "/front_identify_card_photo_URL." + (frontPhoto.extension || "png"),
+                "employee/" + employee.id + "/front_identify_card_photo_URL." + (false),
                 frontPhoto.mimetype || "image/png",
             );

[Timeout] ConditionalExpression
src/employee/employee.service.ts:87:82
             const backPhoto = front_identify_card_photo as MemoryStoredFile;
             const frontURL = await this.storageManager.upload(
                 frontPhoto.buffer,
-                "employee/" + employee.id + "/front_identify_card_photo_URL." + (frontPhoto.extension || "png"),
+                "employee/" + employee.id + "/front_identify_card_photo_URL." + (true),
                 frontPhoto.mimetype || "image/png",
             );

[Timeout] LogicalOperator
src/employee/employee.service.ts:88:17
             const frontURL = await this.storageManager.upload(
                 frontPhoto.buffer,
                 "employee/" + employee.id + "/front_identify_card_photo_URL." + (frontPhoto.extension || "png"),
-                frontPhoto.mimetype || "image/png",
+                frontPhoto.mimetype && "image/png",
             );
 

[Timeout] ConditionalExpression
src/employee/employee.service.ts:93:81
 
             const backURL = await this.storageManager.upload(
                 back_identify_card_photo.buffer,
-                "employee/" + employee.id + "/back_identify_card_photo_URL." + (backPhoto.extension || "png"),
+                "employee/" + employee.id + "/back_identify_card_photo_URL." + (true),
                 backPhoto.mimetype || "image/png",
             );

[Timeout] ConditionalExpression
src/employee/employee.service.ts:93:81
 
             const backURL = await this.storageManager.upload(
                 back_identify_card_photo.buffer,
-                "employee/" + employee.id + "/back_identify_card_photo_URL." + (backPhoto.extension || "png"),
+                "employee/" + employee.id + "/back_identify_card_photo_URL." + (false),
                 backPhoto.mimetype || "image/png",
             );

[Timeout] LogicalOperator
src/employee/employee.service.ts:94:17
             const backURL = await this.storageManager.upload(
                 back_identify_card_photo.buffer,
                 "employee/" + employee.id + "/back_identify_card_photo_URL." + (backPhoto.extension || "png"),
-                backPhoto.mimetype || "image/png",
+                backPhoto.mimetype && "image/png",
             );
 

[Timeout] BlockStatement
src/employee/employee.service.ts:99:30
 
             let profilePictureURL: string | undefined = undefined;
             const avatarPhoto = createEmployeeDto.profile_picture;
-            if (avatarPhoto) {
-                profilePictureURL = await this.storageManager.upload(
-                    avatarPhoto.buffer,
-                    "employee/" + employee.id + "/avatarURL." + (avatarPhoto.extension || "png"),
-                    avatarPhoto.mimetype || "image/png",
-                );
-            } else {
+            if (avatarPhoto) {} else {
                 const avatar = await this.avatarGenerator.generateAvatar(profile.name);
                 profilePictureURL = await this.storageManager.upload(

[Timeout] ConditionalExpression
src/employee/employee.service.ts:102:66
             if (avatarPhoto) {
                 profilePictureURL = await this.storageManager.upload(
                     avatarPhoto.buffer,
-                    "employee/" + employee.id + "/avatarURL." + (avatarPhoto.extension || "png"),
+                    "employee/" + employee.id + "/avatarURL." + (true),
                     avatarPhoto.mimetype || "image/png",
                 );

[Timeout] LogicalOperator
src/employee/employee.service.ts:102:66
             if (avatarPhoto) {
                 profilePictureURL = await this.storageManager.upload(
                     avatarPhoto.buffer,
-                    "employee/" + employee.id + "/avatarURL." + (avatarPhoto.extension || "png"),
+                    "employee/" + employee.id + "/avatarURL." + (avatarPhoto.extension && "png"),
                     avatarPhoto.mimetype || "image/png",
                 );

[Timeout] LogicalOperator
src/employee/employee.service.ts:103:21
                 profilePictureURL = await this.storageManager.upload(
                     avatarPhoto.buffer,
                     "employee/" + employee.id + "/avatarURL." + (avatarPhoto.extension || "png"),
-                    avatarPhoto.mimetype || "image/png",
+                    avatarPhoto.mimetype && "image/png",
                 );
             } else {

[NoCoverage] StringLiteral
src/employee/employee.service.ts:103:45
                 profilePictureURL = await this.storageManager.upload(
                     avatarPhoto.buffer,
                     "employee/" + employee.id + "/avatarURL." + (avatarPhoto.extension || "png"),
-                    avatarPhoto.mimetype || "image/png",
+                    avatarPhoto.mimetype || "",
                 );
             } else {

[NoCoverage] BlockStatement
src/employee/employee.service.ts:105:20
                     "employee/" + employee.id + "/avatarURL." + (avatarPhoto.extension || "png"),
                     avatarPhoto.mimetype || "image/png",
                 );
-            } else {
-                const avatar = await this.avatarGenerator.generateAvatar(profile.name);
-                profilePictureURL = await this.storageManager.upload(
-                    avatar,
-                    "employee/" + employee.id + "/avatarURL.svg",
-                    "image/svg+xml",
-                );
-            }
+            } else {}
 
             employee.profilePictureURL = profilePictureURL;

[NoCoverage] StringLiteral
src/employee/employee.service.ts:110:21
                 profilePictureURL = await this.storageManager.upload(
                     avatar,
                     "employee/" + employee.id + "/avatarURL.svg",
-                    "image/svg+xml",
+                    "",
                 );
             }

[NoCoverage] BlockStatement
src/employee/employee.service.ts:121:48
 
             return await this.employeeRepository.save(employee);
         } catch (error) {
-            if (error instanceof TypeORMError) {
-                try {
-                    await this.storageManager.remove([
-                        "/employee/" + employee.id + "/front_identify_card_photo_URL.png",
-                        "/employee/" + employee.id + "/back_identify_card_photo_URL.png",
-                    ]);
-                } catch (removeError) {
-                    console.error("An error occurred while removing files:", removeError);
-                }
-            }
+            if (error instanceof TypeORMError) {}
             throw error;
         }

[NoCoverage] BlockStatement
src/employee/employee.service.ts:122:21
             return await this.employeeRepository.save(employee);
         } catch (error) {
             if (error instanceof TypeORMError) {
-                try {
-                    await this.storageManager.remove([
-                        "/employee/" + employee.id + "/front_identify_card_photo_URL.png",
-                        "/employee/" + employee.id + "/back_identify_card_photo_URL.png",
-                    ]);
-                } catch (removeError) {
+                try {} catch (removeError) {
                     console.error("An error occurred while removing files:", removeError);
                 }

[NoCoverage] StringLiteral
src/employee/employee.service.ts:124:54
             if (error instanceof TypeORMError) {
                 try {
                     await this.storageManager.remove([
-                        "/employee/" + employee.id + "/front_identify_card_photo_URL.png",
+                        "/employee/" + employee.id + "",
                         "/employee/" + employee.id + "/back_identify_card_photo_URL.png",
                     ]);

[NoCoverage] StringLiteral
src/employee/employee.service.ts:124:25
             if (error instanceof TypeORMError) {
                 try {
                     await this.storageManager.remove([
-                        "/employee/" + employee.id + "/front_identify_card_photo_URL.png",
+                        "" + employee.id + "/front_identify_card_photo_URL.png",
                         "/employee/" + employee.id + "/back_identify_card_photo_URL.png",
                     ]);

[NoCoverage] StringLiteral
src/employee/employee.service.ts:125:54
                 try {
                     await this.storageManager.remove([
                         "/employee/" + employee.id + "/front_identify_card_photo_URL.png",
-                        "/employee/" + employee.id + "/back_identify_card_photo_URL.png",
+                        "/employee/" + employee.id + "",
                     ]);
                 } catch (removeError) {

[NoCoverage] StringLiteral
src/employee/employee.service.ts:125:25
                 try {
                     await this.storageManager.remove([
                         "/employee/" + employee.id + "/front_identify_card_photo_URL.png",
-                        "/employee/" + employee.id + "/back_identify_card_photo_URL.png",
+                        "" + employee.id + "/back_identify_card_photo_URL.png",
                     ]);
                 } catch (removeError) {

[NoCoverage] BlockStatement
src/employee/employee.service.ts:127:39
                         "/employee/" + employee.id + "/front_identify_card_photo_URL.png",
                         "/employee/" + employee.id + "/back_identify_card_photo_URL.png",
                     ]);
-                } catch (removeError) {
-                    console.error("An error occurred while removing files:", removeError);
-                }
+                } catch (removeError) {}
             }
             throw error;

[Timeout] ObjectLiteral
src/employee/employee.service.ts:138:62
         id: string,
         updateEmployeeDto: UpdateEmployeeDto,
     ): Promise<Employee> {
-        let employee = await this.employeeRepository.findOne({
-            where: { id },
-        });
+        let employee = await this.employeeRepository.findOne({});
         console.log(updateEmployeeDto)
 

[Timeout] ObjectLiteral
src/employee/employee.service.ts:139:20
         updateEmployeeDto: UpdateEmployeeDto,
     ): Promise<Employee> {
         let employee = await this.employeeRepository.findOne({
-            where: { id },
+            where: {},
         });
         console.log(updateEmployeeDto)

[Timeout] BlockStatement
src/employee/employee.service.ts:152:34
         try {
             await queryRunner.connect();
             await queryRunner.startTransaction();
-            if (profile_picture) {
-                const imageURL = await this.storageManager.upload(
-                    profile_picture.buffer,
-                    `employee/${id}/${Date.now()}.${profile_picture.extension || "png"}`,
-                    profile_picture.mimetype || "image/png",
-                );
-                employee.profilePictureURL = imageURL;
-            }
+            if (profile_picture) {}
 
             if (front_identify_card_photo) {

[Timeout] LogicalOperator
src/employee/employee.service.ts:155:53
             if (profile_picture) {
                 const imageURL = await this.storageManager.upload(
                     profile_picture.buffer,
-                    `employee/${id}/${Date.now()}.${profile_picture.extension || "png"}`,
+                    `employee/${id}/${Date.now()}.${profile_picture.extension && "png"}`,
                     profile_picture.mimetype || "image/png",
                 );

[Timeout] ConditionalExpression
src/employee/employee.service.ts:155:53
             if (profile_picture) {
                 const imageURL = await this.storageManager.upload(
                     profile_picture.buffer,
-                    `employee/${id}/${Date.now()}.${profile_picture.extension || "png"}`,
+                    `employee/${id}/${Date.now()}.${true}`,
                     profile_picture.mimetype || "image/png",
                 );

[Timeout] LogicalOperator
src/employee/employee.service.ts:156:21
                 const imageURL = await this.storageManager.upload(
                     profile_picture.buffer,
                     `employee/${id}/${Date.now()}.${profile_picture.extension || "png"}`,
-                    profile_picture.mimetype || "image/png",
+                    profile_picture.mimetype && "image/png",
                 );
                 employee.profilePictureURL = imageURL;

[Timeout] StringLiteral
src/employee/employee.service.ts:156:49
                 const imageURL = await this.storageManager.upload(
                     profile_picture.buffer,
                     `employee/${id}/${Date.now()}.${profile_picture.extension || "png"}`,
-                    profile_picture.mimetype || "image/png",
+                    profile_picture.mimetype || "",
                 );
                 employee.profilePictureURL = imageURL;

[Timeout] ConditionalExpression
src/employee/employee.service.ts:161:17
                 employee.profilePictureURL = imageURL;
             }
 
-            if (front_identify_card_photo) {
+            if (true) {
                 const imageURL = await this.storageManager.upload(
                     front_identify_card_photo.buffer,

[Timeout] ConditionalExpression
src/employee/employee.service.ts:161:17
                 employee.profilePictureURL = imageURL;
             }
 
-            if (front_identify_card_photo) {
+            if (false) {
                 const imageURL = await this.storageManager.upload(
                     front_identify_card_photo.buffer,

[Timeout] ConditionalExpression
src/employee/employee.service.ts:164:53
             if (front_identify_card_photo) {
                 const imageURL = await this.storageManager.upload(
                     front_identify_card_photo.buffer,
-                    `employee/${id}/${Date.now()}.${front_identify_card_photo.extension || "png"}`,
+                    `employee/${id}/${Date.now()}.${true}`,
                     front_identify_card_photo.mimetype || "image/png",
                 );

[Timeout] LogicalOperator
src/employee/employee.service.ts:164:53
             if (front_identify_card_photo) {
                 const imageURL = await this.storageManager.upload(
                     front_identify_card_photo.buffer,
-                    `employee/${id}/${Date.now()}.${front_identify_card_photo.extension || "png"}`,
+                    `employee/${id}/${Date.now()}.${front_identify_card_photo.extension && "png"}`,
                     front_identify_card_photo.mimetype || "image/png",
                 );

[Timeout] LogicalOperator
src/employee/employee.service.ts:165:21
                 const imageURL = await this.storageManager.upload(
                     front_identify_card_photo.buffer,
                     `employee/${id}/${Date.now()}.${front_identify_card_photo.extension || "png"}`,
-                    front_identify_card_photo.mimetype || "image/png",
+                    front_identify_card_photo.mimetype && "image/png",
                 );
                 profile.front_identify_card_photo_URL = imageURL;

[Timeout] StringLiteral
src/employee/employee.service.ts:165:59
                 const imageURL = await this.storageManager.upload(
                     front_identify_card_photo.buffer,
                     `employee/${id}/${Date.now()}.${front_identify_card_photo.extension || "png"}`,
-                    front_identify_card_photo.mimetype || "image/png",
+                    front_identify_card_photo.mimetype || "",
                 );
                 profile.front_identify_card_photo_URL = imageURL;

[Timeout] BlockStatement
src/employee/employee.service.ts:170:43
                 profile.front_identify_card_photo_URL = imageURL;
             }
 
-            if (back_identify_card_photo) {
-                const imageURL = await this.storageManager.upload(
-                    back_identify_card_photo.buffer,
-                    `employee/${id}/${Date.now()}.${back_identify_card_photo.extension || "png"}`,
-                    back_identify_card_photo.mimetype || "image/png",
-                );
-                profile.back_identify_card_photo_URL = imageURL;
-            }
+            if (back_identify_card_photo) {}
             employee.id = id;
             employee.profile = profile;

[Timeout] ConditionalExpression
src/employee/employee.service.ts:170:17
                 profile.front_identify_card_photo_URL = imageURL;
             }
 
-            if (back_identify_card_photo) {
+            if (true) {
                 const imageURL = await this.storageManager.upload(
                     back_identify_card_photo.buffer,

[Timeout] LogicalOperator
src/employee/employee.service.ts:173:53
             if (back_identify_card_photo) {
                 const imageURL = await this.storageManager.upload(
                     back_identify_card_photo.buffer,
-                    `employee/${id}/${Date.now()}.${back_identify_card_photo.extension || "png"}`,
+                    `employee/${id}/${Date.now()}.${back_identify_card_photo.extension && "png"}`,
                     back_identify_card_photo.mimetype || "image/png",
                 );

[Timeout] ConditionalExpression
src/employee/employee.service.ts:173:53
             if (back_identify_card_photo) {
                 const imageURL = await this.storageManager.upload(
                     back_identify_card_photo.buffer,
-                    `employee/${id}/${Date.now()}.${back_identify_card_photo.extension || "png"}`,
+                    `employee/${id}/${Date.now()}.${false}`,
                     back_identify_card_photo.mimetype || "image/png",
                 );

[Timeout] LogicalOperator
src/employee/employee.service.ts:174:21
                 const imageURL = await this.storageManager.upload(
                     back_identify_card_photo.buffer,
                     `employee/${id}/${Date.now()}.${back_identify_card_photo.extension || "png"}`,
-                    back_identify_card_photo.mimetype || "image/png",
+                    back_identify_card_photo.mimetype && "image/png",
                 );
                 profile.back_identify_card_photo_URL = imageURL;

[NoCoverage] BlockStatement
src/employee/employee.service.ts:182:25
             employee.profile = profile;
             await this.employeeRepository.save(employee);
             await queryRunner.commitTransaction();
-        } catch (error) {
-
-            await queryRunner.rollbackTransaction();
-            throw error;
-        } finally {
+        } catch (error) {} finally {
 
             await queryRunner.release();

[Timeout] BlockStatement
src/employee/employee.service.ts:186:19
 
             await queryRunner.rollbackTransaction();
             throw error;
-        } finally {
-
-            await queryRunner.release();
-        }
+        } finally {}
         return employee;
     }

[Timeout] BooleanLiteral
src/employee/employee.service.ts:256:20
     findAll(role?: PersonRole): Promise<Employee[]> {
         return this.employeeRepository.find({
             where: role ? {} : {},
-            cache: true,
+            cache: false,
         });
     }
