[Timeout] StringLiteral
src/resident/resident.service.ts:87:28
         let resident = new Resident();
         resident.payment_info = payment_info;
         if (id) resident.id = id;
-        else resident.id = "RES" + this.idGenerate.generateId();
+        else resident.id = "" + this.idGenerate.generateId();
         try {
             const frontPhoto = front_identify_card_photo as MemoryStoredFile;

[Timeout] ConditionalExpression
src/resident/resident.service.ts:97:22
                 "resident/" +
                     resident.id +
                     "/front_identify_card_photo_URL." +
-                    (frontPhoto.extension || "png"),
+                    (true),
                 frontPhoto.mimetype || "image/png",
             );

[Timeout] StringLiteral
src/resident/resident.service.ts:104:21
                 backPhoto.buffer,
                 "resident/" +
                     resident.id +
-                    "/back_identify_card_photo_URL." +
+                    "" +
                     (backPhoto.extension || "png"),
                 backPhoto.mimetype || "image/png",

[Timeout] LogicalOperator
src/resident/resident.service.ts:105:22
                 "resident/" +
                     resident.id +
                     "/back_identify_card_photo_URL." +
-                    (backPhoto.extension || "png"),
+                    (backPhoto.extension && "png"),
                 backPhoto.mimetype || "image/png",
             );

[NoCoverage] StringLiteral
src/resident/resident.service.ts:129:21
                 avatarURL = await this.storageManager.upload(
                     avatar,
                     "resident/" + resident.id + "/avatarURL.svg",
-                    "image/svg+xml",
+                    "",
                 );
             }

[Timeout] BlockStatement
src/resident/resident.service.ts:138:24
             resident.profile = profile;
             const residentData =  await this.residentRepository.save(resident);
             //set account
-            if (email) {
-                resident.account_id = resident.id;
-                let account = new Account();
-                account.owner_id = resident.account_id;
-                account.email = email;
-                account.password = this.hashService.hash(profile.phone_number);
-                account.avatarURL = avatarURL;
-                account.resident = resident;    
-                await this.accountRepository.save(account);
-            }
+            if (email) {}
             return residentData
         } catch (error) {

[NoCoverage] BlockStatement
src/resident/resident.service.ts:151:21
             return residentData
         } catch (error) {
             if (error instanceof TypeORMError) {
-                try {
-                    await this.storageManager.remove([
-                        "/resident/" +
-                            resident.id +
-                            "/front_identify_card_photo_URL.png",
-                        "/resident/" +
-                            resident.id +
-                            "/back_identify_card_photo_URL.png",
-                    ]);
-                } catch (error) {
+                try {} catch (error) {
                     console.error(error);
                 }

[NoCoverage] BlockStatement
src/resident/resident.service.ts:160:33
                             resident.id +
                             "/back_identify_card_photo_URL.png",
                     ]);
-                } catch (error) {
-                    console.error(error);
-                }
+                } catch (error) {}
             }
             throw new Error("Can not create resident");

[Timeout] ObjectLiteral
src/resident/resident.service.ts:170:26
     async search(query: string): Promise<Resident[]> {
         const result = await this.residentRepository.find({
             where: {
-                profile: { name: Like(`%${query}%`) },
+                profile: {},
             },
         });

[Timeout] BlockStatement
src/resident/resident.service.ts:194:27
         resident.payment_info = payment_info;
         let profile = plainToInstance(Profile, rest);
         let avatarURL: string | undefined;
-        if (avatar_photo) {
-            const avataPhoto = avatar_photo as MemoryStoredFile;
-            avatarURL = await this.storageManager.upload(
-                avataPhoto.buffer,
-                "resident/" +
-                    resident.id +
-                    "/avatarURL." +
-                    (avataPhoto.extension || "png"),
-                avataPhoto.mimetype || "image/png",
-            );
-        } 
+        if (avatar_photo) {} 
         if (account !== null) {
             account.email = email as string;

[Timeout] StringLiteral
src/resident/resident.service.ts:198:17
             const avataPhoto = avatar_photo as MemoryStoredFile;
             avatarURL = await this.storageManager.upload(
                 avataPhoto.buffer,
-                "resident/" +
+                "" +
                     resident.id +
                     "/avatarURL." +

[Timeout] StringLiteral
src/resident/resident.service.ts:200:21
                 avataPhoto.buffer,
                 "resident/" +
                     resident.id +
-                    "/avatarURL." +
+                    "" +
                     (avataPhoto.extension || "png"),
                 avataPhoto.mimetype || "image/png",

[Timeout] BlockStatement
src/resident/resident.service.ts:205:31
                 avataPhoto.mimetype || "image/png",
             );
         } 
-        if (account !== null) {
-            account.email = email as string;
-            if(avatarURL) {
-                account.avatarURL = avatarURL;
-            }
-            await this.accountRepository.save(account);
-        }
+        if (account !== null) {}
         resident.profile = profile;
         return await this.residentRepository.save(resident);

[Timeout] BlockStatement
src/resident/resident.service.ts:207:27
         } 
         if (account !== null) {
             account.email = email as string;
-            if(avatarURL) {
-                account.avatarURL = avatarURL;
-            }
+            if(avatarURL) {}
             await this.accountRepository.save(account);
         }

[Timeout] ObjectLiteral
src/resident/resident.service.ts:217:20
     }
     findOne(id: string): Promise<Resident | null> {
         return this.residentRepository.findOne({
-            where: {
-                id,
-            },
+            where: {},
             cache: true,
             relations: ["account"],

[Timeout] StringLiteral
src/resident/resident.service.ts:221:25
                 id,
             },
             cache: true,
-            relations: ["account"],
+            relations: [""],
         });
     }

[Timeout] BlockStatement
src/resident/resident.service.ts:243:30
        
     }
 
-    async delete(id: string) {
-        try {
-            const result = await this.residentRepository.softDelete({ id });
-            return result;
-        }
-        catch(err) {
-            throw new Error("Can not delete resident")
-        }
-        
-       
-    }
+    async delete(id: string) {}
     async findAll(): Promise<Resident[]> {
         const residents = await this.residentRepository.find({
