[Timeout] BlockStatement
src/contract/contract.service.ts:21:66
         private storageManager: StorageManager,
         private readonly idGenerate: IdGenerator,
     ) {}
-    async create(createContract: CreateContractDto, id?: string) {
-        const { ...rest } = createContract;
-        let contract = this.contractRepository.create(rest);
-        console.log(contract);
-        contract.contract_id = "CT" + this.idGenerate.generateId().toString();
-        if (id) contract.contract_id = id;
-        return await this.contractRepository.save(contract);
-        //await this.findOne(contract.contract_id);
-    }
+    async create(createContract: CreateContractDto, id?: string) {}
 
     async findAll(page?: number) {

[Timeout] StringLiteral
src/contract/contract.service.ts:25:32
         const { ...rest } = createContract;
         let contract = this.contractRepository.create(rest);
         console.log(contract);
-        contract.contract_id = "CT" + this.idGenerate.generateId().toString();
+        contract.contract_id = "" + this.idGenerate.generateId().toString();
         if (id) contract.contract_id = id;
         return await this.contractRepository.save(contract);

[Timeout] EqualityOperator
src/contract/contract.service.ts:32:34
     }
 
     async findAll(page?: number) {
-        if (page != undefined && page != null && page > 0) {
+        if (page != undefined && page == null && page > 0) {
             return await this.contractRepository.find({
                 skip: (page - 1) * 30,

[Timeout] ObjectLiteral
src/contract/contract.service.ts:33:55
 
     async findAll(page?: number) {
         if (page != undefined && page != null && page > 0) {
-            return await this.contractRepository.find({
-                skip: (page - 1) * 30,
-                take: 30,
-                relations: ["resident", "apartment"],
-                cache: true,
-            });
+            return await this.contractRepository.find({});
         }
 

[Timeout] ArithmeticOperator
src/contract/contract.service.ts:34:24
     async findAll(page?: number) {
         if (page != undefined && page != null && page > 0) {
             return await this.contractRepository.find({
-                skip: (page - 1) * 30,
+                skip: (page + 1) * 30,
                 take: 30,
                 relations: ["resident", "apartment"],

[Timeout] ArithmeticOperator
src/contract/contract.service.ts:34:23
     async findAll(page?: number) {
         if (page != undefined && page != null && page > 0) {
             return await this.contractRepository.find({
-                skip: (page - 1) * 30,
+                skip: (page - 1) / 30,
                 take: 30,
                 relations: ["resident", "apartment"],

[Timeout] StringLiteral
src/contract/contract.service.ts:36:29
             return await this.contractRepository.find({
                 skip: (page - 1) * 30,
                 take: 30,
-                relations: ["resident", "apartment"],
+                relations: ["", "apartment"],
                 cache: true,
             });

[Timeout] StringLiteral
src/contract/contract.service.ts:36:41
             return await this.contractRepository.find({
                 skip: (page - 1) * 30,
                 take: 30,
-                relations: ["resident", "apartment"],
+                relations: ["resident", ""],
                 cache: true,
             });

[Timeout] BooleanLiteral
src/contract/contract.service.ts:37:24
                 skip: (page - 1) * 30,
                 take: 30,
                 relations: ["resident", "apartment"],
-                cache: true,
+                cache: false,
             });
         }

[Timeout] StringLiteral
src/contract/contract.service.ts:53:25
                 contract_id: id,
             },
             cache: true,
-            relations: ["resident", "apartment"],
+            relations: ["", "apartment"],
         });
         if (contract == null) throw new NotFoundException();

[Timeout] BlockStatement
src/contract/contract.service.ts:66:17
         const queryRunner = this.dataSource.createQueryRunner();
 
         if (imageUpdate) {
-            try {
-                await queryRunner.connect();
-                await queryRunner.startTransaction();
-                const imageURL = await this.storageManager.upload(
-                    imageUpdate.buffer,
-                    `contract/${id}/${Date.now()}.png`,
-                    "image/png",
-                );
-                contract.contract_id = id;
-                contract.contract_with_signature_photo_URL = imageURL;
-                contract = await this.contractRepository.save(contract);
-                await queryRunner.commitTransaction();
-            } catch (error) {
+            try {} catch (error) {
                 if (error instanceof TypeORMError) {
                     try {

[Timeout] StringLiteral
src/contract/contract.service.ts:72:21
                 const imageURL = await this.storageManager.upload(
                     imageUpdate.buffer,
                     `contract/${id}/${Date.now()}.png`,
-                    "image/png",
+                    "",
                 );
                 contract.contract_id = id;

[NoCoverage] BlockStatement
src/contract/contract.service.ts:78:29
                 contract.contract_with_signature_photo_URL = imageURL;
                 contract = await this.contractRepository.save(contract);
                 await queryRunner.commitTransaction();
-            } catch (error) {
-                if (error instanceof TypeORMError) {
-                    try {
-                        await this.storageManager.remove([
-                            `contract/${id}/${Date.now()}.` +
-                                (imageUpdate.extension || "png"),
-                            imageUpdate.mimetype || "image/png",
-                        ]);
-                    } catch (error) {
-                        console.error(error);
-                    }
-                }
-                throw error;
-            } finally {
+            } catch (error) {} finally {
                 await queryRunner.release();
             }

[NoCoverage] BlockStatement
src/contract/contract.service.ts:79:52
                 contract = await this.contractRepository.save(contract);
                 await queryRunner.commitTransaction();
             } catch (error) {
-                if (error instanceof TypeORMError) {
-                    try {
-                        await this.storageManager.remove([
-                            `contract/${id}/${Date.now()}.` +
-                                (imageUpdate.extension || "png"),
-                            imageUpdate.mimetype || "image/png",
-                        ]);
-                    } catch (error) {
-                        console.error(error);
-                    }
-                }
+                if (error instanceof TypeORMError) {}
                 throw error;
             } finally {

[NoCoverage] BlockStatement
src/contract/contract.service.ts:80:25
                 await queryRunner.commitTransaction();
             } catch (error) {
                 if (error instanceof TypeORMError) {
-                    try {
-                        await this.storageManager.remove([
-                            `contract/${id}/${Date.now()}.` +
-                                (imageUpdate.extension || "png"),
-                            imageUpdate.mimetype || "image/png",
-                        ]);
-                    } catch (error) {
+                    try {} catch (error) {
                         console.error(error);
                     }

[NoCoverage] ArrayDeclaration
src/contract/contract.service.ts:81:58
             } catch (error) {
                 if (error instanceof TypeORMError) {
                     try {
-                        await this.storageManager.remove([
-                            `contract/${id}/${Date.now()}.` +
-                                (imageUpdate.extension || "png"),
-                            imageUpdate.mimetype || "image/png",
-                        ]);
+                        await this.storageManager.remove([]);
                     } catch (error) {
                         console.error(error);

[NoCoverage] ConditionalExpression
src/contract/contract.service.ts:83:34
                     try {
                         await this.storageManager.remove([
                             `contract/${id}/${Date.now()}.` +
-                                (imageUpdate.extension || "png"),
+                                (false),
                             imageUpdate.mimetype || "image/png",
                         ]);

[NoCoverage] LogicalOperator
src/contract/contract.service.ts:84:29
                         await this.storageManager.remove([
                             `contract/${id}/${Date.now()}.` +
                                 (imageUpdate.extension || "png"),
-                            imageUpdate.mimetype || "image/png",
+                            imageUpdate.mimetype && "image/png",
                         ]);
                     } catch (error) {

[Timeout] ObjectLiteral
src/contract/contract.service.ts:96:13
             }
         }
         let result = await this.contractRepository.update(
-            { contract_id: id },
+            {},
             { ...contract },
         );

[Timeout] BlockStatement
src/contract/contract.service.ts:103:30
         return await isQueryAffected(result);
     }
 
-    async remove(id: string) {
-        return await this.contractRepository.softDelete({
-            contract_id: id,
-        });
-    }
+    async remove(id: string) {}
 }
 
