[Timeout] BlockStatement
src/account/account.controller.ts:10:56
     constructor(private readonly accountService: AccountService) {}
 
     @Post()
-    create(@Body() createAccountDto: CreateAccountDto) {
-        return this.accountService.create(createAccountDto);
-    }
+    create(@Body() createAccountDto: CreateAccountDto) {}
 
     @Get()

[Timeout] BlockStatement
src/account/account.controller.ts:25:37
     }
 
     @Delete(":id")
-    remove(@Param("id") id: string) {
-        return this.accountService.remove(id);
-    }
+    remove(@Param("id") id: string) {}
 }
 
