[Timeout] BlockStatement
src/apartment/apartment.controller.ts:26:60
     @Post()
     @ApiConsumes("multipart/form-data")
     @FormDataRequest()
-    create(@Body() createApartmentDto: CreateApartmentDto) {
-        return this.apartmentRepository.create(createApartmentDto);
-    }
+    create(@Body() createApartmentDto: CreateApartmentDto) {}
 
     @ApiQuery({

[Timeout] BlockStatement
src/apartment/apartment.controller.ts:37:42
             "Page number: Page indexed from 1, each page contain 30 items, if null then return all.",
     })
     @Get()
-    findAll(@Query("page") page: number) {
-        if (Number.isNaN(page)) return this.apartmentRepository.findAll();
-        else return this.apartmentRepository.findAll(page);
-    }
+    findAll(@Query("page") page: number) {}
 
     @Get(":id")

[Timeout] ConditionalExpression
src/apartment/apartment.controller.ts:45:13
     @Get(":id")
     async findOne(@Param("id") id: string) {
         const apartment = await this.apartmentRepository.findOne(id);
-        if (apartment) return apartment;
+        if (true) return apartment;
         throw new NotFoundException("Apartment not found");
     }
