[NoCoverage] BlockStatement
src/apartment/apartment.service.ts:101:49
 
             apartment.imageURLs = uploadResults.map((result) => result.value);
 
-            if (createApartmentDto.residentIds) {
-                const residents = await this.residentRepository.find({
-                    where: { id: In(createApartmentDto.residentIds) },
-                });
-                if (residents.length !== createApartmentDto.residentIds.length)
-                    throw new NotFoundException("Some resident not found");
-                apartment.residents = residents;
-            }
+            if (createApartmentDto.residentIds) {}
 
             apartment = await this.apartmentRepository.save(apartment);

[NoCoverage] ConditionalExpression
src/apartment/apartment.service.ts:105:21
                 const residents = await this.residentRepository.find({
                     where: { id: In(createApartmentDto.residentIds) },
                 });
-                if (residents.length !== createApartmentDto.residentIds.length)
+                if (false)
                     throw new NotFoundException("Some resident not found");
                 apartment.residents = residents;

[NoCoverage] EqualityOperator
src/apartment/apartment.service.ts:131:13
     }
 
     async findAll(page?: number) {
-        if (page != undefined && page != null) {
+        if (page == undefined && page != null) {
             return await this.apartmentRepository.find({
                 skip: (page - 1) * 30,

[NoCoverage] ConditionalExpression
src/apartment/apartment.service.ts:131:13
     }
 
     async findAll(page?: number) {
-        if (page != undefined && page != null) {
+        if (true && page != null) {
             return await this.apartmentRepository.find({
                 skip: (page - 1) * 30,

[NoCoverage] ArithmeticOperator
src/apartment/apartment.service.ts:133:24
     async findAll(page?: number) {
         if (page != undefined && page != null) {
             return await this.apartmentRepository.find({
-                skip: (page - 1) * 30,
+                skip: (page + 1) * 30,
                 take: 30,
             });

[NoCoverage] ObjectLiteral
src/apartment/apartment.service.ts:143:20
 
     async findOne(id: string) {
         return await this.apartmentRepository.findOne({
-            where: { apartment_id: id },
+            where: {},
         });
     }

[NoCoverage] ConditionalExpression
src/apartment/apartment.service.ts:164:21
             if (!apartment) throw new NotFoundException("Apartment Not found");
 
             if (images) {
-                if (this.newImageHaveStrangeURL(images, apartment.imageURLs))
+                if (false)
                     throw new BadRequestException("Detect strange URL");
 

[NoCoverage] ArithmeticOperator
src/apartment/apartment.service.ts:171:29
                     images.map((element, index) => {
                         if (isString(element)) return element;
                         const uploadPath = `apartment/${id}/${
-                            index + Date.now() + (element.extension || ".png")
+                            index - Date.now() + (element.extension || ".png")
                         }`;
                         uploadPaths.push(uploadPath);

[NoCoverage] ConditionalExpression
src/apartment/apartment.service.ts:197:17
         return isQueryAffected(result);
         } catch (error) {
             await queryRunnder.rollbackTransaction();
-            if (uploadPaths.length > 0)
+            if (false)
                 await this.storageManager.remove(uploadPaths);
             console.error(error);

[NoCoverage] ConditionalExpression
src/apartment/apartment.service.ts:210:16
     private isPromiseFulfilledResult<T>(
         result: PromiseSettledResult<T>,
     ): result is PromiseFulfilledResult<T> {
-        return result.status === "fulfilled";
+        return false;
     }
 

[NoCoverage] ConditionalExpression
src/apartment/apartment.service.ts:210:16
     private isPromiseFulfilledResult<T>(
         result: PromiseSettledResult<T>,
     ): result is PromiseFulfilledResult<T> {
-        return result.status === "fulfilled";
+        return true;
     }
 

[NoCoverage] ConditionalExpression
src/apartment/apartment.service.ts:216:42
     private isPromiseFulfilledResultArray<T>(
         results: PromiseSettledResult<T>[],
     ): results is PromiseFulfilledResult<T>[] {
-        return results.every((result) => result.status === "fulfilled");
+        return results.every((result) => false);
     }
 

[NoCoverage] ArrowFunction
src/apartment/apartment.service.ts:223:47
         newImages: (string | MemoryStoredFile)[],
         oldImageURLS: string[],
     ) {
-        const newImageURLS = newImages.filter((image): image is string =>
-            isString(image),
+        const newImageURLS = newImages.filter(() => undefined,
         );
 

[NoCoverage] EqualityOperator
src/apartment/apartment.service.ts:227:13
             isString(image),
         );
 
-        if (difference(newImageURLS, oldImageURLS).length > 0) return true;
+        if (difference(newImageURLS, oldImageURLS).length >= 0) return true;
         return false;
     }
