[NoCoverage] StringLiteral
src/building/building.service.ts:52:43
         try {
             return await this.buildingRepository.save(building);
         } catch (error) {
-            throw new BadRequestException("Create fail");
+            throw new BadRequestException("");
         }
     }

[Timeout] BlockStatement
src/building/building.service.ts:70:68
             throw new NotFoundException("Not found building");
         }
     }
-    async update(id: string, updateBuildingDto: UpdateBuildingDto) {
-        try {
-            let result = await this.buildingRepository.update(
-                id,
-                updateBuildingDto,
-            );
-            return result;
-        } catch (error) {
-            throw new BadRequestException("Id not found.");
-        }
-    }
+    async update(id: string, updateBuildingDto: UpdateBuildingDto) {}
     async delete(id: string) {
         try {

[Killed] BlockStatement
src/building/building.service.ts:71:13
         }
     }
     async update(id: string, updateBuildingDto: UpdateBuildingDto) {
-        try {
-            let result = await this.buildingRepository.update(
-                id,
-                updateBuildingDto,
-            );
-            return result;
-        } catch (error) {
+        try {} catch (error) {
             throw new BadRequestException("Id not found.");
         }
killedBy: BuildingService should update success building
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"affected": 1, "generatedMaps": [], "raw": []}
Received: undefined

[Timeout] BlockStatement
src/building/building.service.ts:81:30
             throw new BadRequestException("Id not found.");
         }
     }
-    async delete(id: string) {
-        try {
-            const result = await this.buildingRepository.softDelete({
-                building_id: id,
-            });
-            return result;
-        } catch (error) {
-            throw new Error("can not delete");
-        }
-    }
+    async delete(id: string) {}
     /**
      *

[Timeout] BlockStatement
src/building/building.service.ts:82:13
         }
     }
     async delete(id: string) {
-        try {
-            const result = await this.buildingRepository.softDelete({
-                building_id: id,
-            });
-            return result;
-        } catch (error) {
+        try {} catch (error) {
             throw new Error("can not delete");
         }

[Timeout] ObjectLiteral
src/building/building.service.ts:83:69
     }
     async delete(id: string) {
         try {
-            const result = await this.buildingRepository.softDelete({
-                building_id: id,
-            });
+            const result = await this.buildingRepository.softDelete({});
             return result;
         } catch (error) {

[Timeout] BlockStatement
src/building/building.service.ts:87:25
                 building_id: id,
             });
             return result;
-        } catch (error) {
-            throw new Error("can not delete");
-        }
+        } catch (error) {}
     }
     /**

[Timeout] StringLiteral
src/building/building.service.ts:99:28
     async search(query: string): Promise<Building[]> {
         const result = await this.buildingRepository.find({
             where: {
-                name: Like(`%${query}%`),
+                name: Like(``),
             },
         });
