[Timeout] BlockStatement
src/account/account.service.ts:6:48
 
 @Injectable()
 export class AccountService {
-    create(createAccountDto: CreateAccountDto) {
-        return "This action adds a new account";
-    }
+    create(createAccountDto: CreateAccountDto) {}
 
     findAll() {

[Timeout] StringLiteral
src/account/account.service.ts:7:16
 @Injectable()
 export class AccountService {
     create(createAccountDto: CreateAccountDto) {
-        return "This action adds a new account";
+        return "";
     }
 

[Timeout] BlockStatement
src/account/account.service.ts:10:15
         return "This action adds a new account";
     }
 
-    findAll() {
-        return `This action returns all account`;
-    }
+    findAll() {}
 
     findOne(id: string) {

[Timeout] StringLiteral
src/account/account.service.ts:11:16
     }
 
     findAll() {
-        return `This action returns all account`;
+        return ``;
     }
 

[Timeout] BlockStatement
src/account/account.service.ts:14:25
         return `This action returns all account`;
     }
 
-    findOne(id: string) {
-        return `This action returns a #${id} account`;
-    }
+    findOne(id: string) {}
 
     remove(id: string) {

[Timeout] BlockStatement
src/account/account.service.ts:18:24
         return `This action returns a #${id} account`;
     }
 
-    remove(id: string) {
-        return `This action removes a #${id} account`;
-    }
+    remove(id: string) {}
 }
 
