[Timeout] BlockStatement
src/employee/employee.controller.ts:51:66
         })
         @Post()
         @FormDataRequest()
-        async create(@Body() createPersonDto: CreateEmployeeDto) {
-                return await this.employeeRepository.create(createPersonDto);
-        }
+        async create(@Body() createPersonDto: CreateEmployeeDto) {}
         @Get(":id")
         findOne(@Param("id") id: string) {

[Timeout] BlockStatement
src/employee/employee.controller.ts:55:42
                 return await this.employeeRepository.create(createPersonDto);
         }
         @Get(":id")
-        findOne(@Param("id") id: string) {
-                return this.employeeRepository.findOne(id);
-        }
+        findOne(@Param("id") id: string) {}
         @ApiOperation({ summary: "update employee" })
         @Patch(":id")

[Timeout] BlockStatement
src/employee/employee.controller.ts:87:41
                 return this.employeeRepository.findAll();
         }
         @Delete(":id")
-        remove(@Param("id") id: string) {
-                return this.employeeRepository.delete(id);
-        }
+        remove(@Param("id") id: string) {}
 }
