[Timeout] BlockStatement
src/resident/resident.controller.ts:61:57
         return await this.residentRepository.create(createResidentDto);
     }
     @Get("/search")
-    async searchResident(@Query("query") query: string) {
-        const result = await this.residentRepository.search(query);
-        return result;
-    }
+    async searchResident(@Query("query") query: string) {}
     @Delete("/:id")
     async softDeleteResident(@Param("id") id: string) {

[Timeout] BlockStatement
src/resident/resident.controller.ts:66:55
         return result;
     }
     @Delete("/:id")
-    async softDeleteResident(@Param("id") id: string) {
-        try {
-            const result = await this.residentRepository.delete(id);
-            return result;
-        } catch (error) {
-            throw new Error("Resident not found to delete");
-        }
-    }
+    async softDeleteResident(@Param("id") id: string) {}
     /**
      *
