[Timeout] BlockStatement
src/contract/contract.controller.ts:32:58
     @Post()
     @ApiConsumes("multipart/form-data")
     @FormDataRequest()
-    create(@Body() createContractDto: CreateContractDto) {
-        return this.contractService.create(createContractDto);
-    }
+    create(@Body() createContractDto: CreateContractDto) {}
 
     @ApiQuery({

[Timeout] ConditionalExpression
src/contract/contract.controller.ts:45:13
     @Get()
    async findAll(@Query("page") page?: number) {
         var data;
-        if (Number.isNaN(page)) data = await this.contractService.findAll();
+        if (false) data = await this.contractService.findAll();
         else data = await this.contractService.findAll(page);
         return { data, current_page: page, per_page: 30, total: data.length};

[Timeout] ObjectLiteral
src/contract/contract.controller.ts:47:16
         var data;
         if (Number.isNaN(page)) data = await this.contractService.findAll();
         else data = await this.contractService.findAll(page);
-        return { data, current_page: page, per_page: 30, total: data.length};
+        return {};
     }
 

[Timeout] BlockStatement
src/contract/contract.controller.ts:61:7
     async update(
         @Param("id") id: string,
         @Body() updateContractDto: UpdateContractDto,
-    ) {
-        const result = await this.contractService.update(id, updateContractDto);
-        if (result)
-            return [{ msg: "Contract updated" }, await this.findOne(id)];
-        throw new NotFoundException("Contract not found");
-    }
+    ) {}
 
     @Delete(":id")

[Timeout] ConditionalExpression
src/contract/contract.controller.ts:63:13
         @Body() updateContractDto: UpdateContractDto,
     ) {
         const result = await this.contractService.update(id, updateContractDto);
-        if (result)
+        if (true)
             return [{ msg: "Contract updated" }, await this.findOne(id)];
         throw new NotFoundException("Contract not found");

[Timeout] ConditionalExpression
src/contract/contract.controller.ts:63:13
         @Body() updateContractDto: UpdateContractDto,
     ) {
         const result = await this.contractService.update(id, updateContractDto);
-        if (result)
+        if (false)
             return [{ msg: "Contract updated" }, await this.findOne(id)];
         throw new NotFoundException("Contract not found");

[Timeout] ArrayDeclaration
src/contract/contract.controller.ts:64:20
     ) {
         const result = await this.contractService.update(id, updateContractDto);
         if (result)
-            return [{ msg: "Contract updated" }, await this.findOne(id)];
+            return [];
         throw new NotFoundException("Contract not found");
     }

[Timeout] BlockStatement
src/contract/contract.controller.ts:69:37
     }
 
     @Delete(":id")
-    remove(@Param("id") id: string) {
-        return this.contractService.remove(id);
-    }
+    remove(@Param("id") id: string) {}
 }
 
