[NoCoverage] ObjectLiteral
src/main.ts:41:44
         .addBearerAuth()
         .build();
 
-    const option: SwaggerDocumentOptions = {
-        deepScanRoutes: true,
-        extraModels: [Admin, Technician, Manager, Resident, Employee],
-    };
+    const option: SwaggerDocumentOptions = {};
     const document = SwaggerModule.createDocument(app, config, option);
 
