[Timeout] BlockStatement
src/building/building.controller.ts:48:15
             "Page number: Page indexed from 1, each page contain 30 items, if null then return all.",
     })
     @Get()
-    findAll() {
-        return this.buildingRepository.findAll();
-    }
+    findAll() {}
     @Get(":id")
     async findOne(@Param("id") id: string) {

[Timeout] BlockStatement
src/building/building.controller.ts:52:44
         return this.buildingRepository.findAll();
     }
     @Get(":id")
-    async findOne(@Param("id") id: string) {
-        try {
-            const building = await this.buildingRepository.findOne(id);
-            if (building) return building;
-        }
-        catch(e) {
-            throw new Error("Building not found");
-        }
-        
-    }
+    async findOne(@Param("id") id: string) {}
 
     @Patch(":id")

[Timeout] ConditionalExpression
src/building/building.controller.ts:55:17
     async findOne(@Param("id") id: string) {
         try {
             const building = await this.buildingRepository.findOne(id);
-            if (building) return building;
+            if (true) return building;
         }
         catch(e) {

[Timeout] BlockStatement
src/building/building.controller.ts:57:18
             const building = await this.buildingRepository.findOne(id);
             if (building) return building;
         }
-        catch(e) {
-            throw new Error("Building not found");
-        }
+        catch(e) {}
         
     }

[Timeout] BlockStatement
src/building/building.controller.ts:67:7
     async update(
         @Param("id") id: string,
         @Body() updateBuildingDto: UpdateBuildingDto,
-    ) {
-        try {
-            const result = await this.buildingRepository.update(
-                id,
-                updateBuildingDto,
-            );
-            return result;
-        } catch(e) {
-            throw new Error("Building not found");
-
-        }
-    }
+    ) {}
     @Delete("/:id")
     async softDeleteBuilding(@Param("id") id: string) {

[Timeout] BlockStatement
src/building/building.controller.ts:68:13
         @Param("id") id: string,
         @Body() updateBuildingDto: UpdateBuildingDto,
     ) {
-        try {
-            const result = await this.buildingRepository.update(
-                id,
-                updateBuildingDto,
-            );
-            return result;
-        } catch(e) {
+        try {} catch(e) {
             throw new Error("Building not found");
 

[Timeout] BlockStatement
src/building/building.controller.ts:80:55
         }
     }
     @Delete("/:id")
-    async softDeleteBuilding(@Param("id") id: string) {
-        try {
-            const result = await this.buildingRepository.delete(id);
-            return result;
-        }
-        catch (error) {
-            throw new Error("Building not found to delete");
-            
-        }
-    }
+    async softDeleteBuilding(@Param("id") id: string) {}
 }
 

[Killed] BlockStatement
src/building/building.controller.ts:81:13
     }
     @Delete("/:id")
     async softDeleteBuilding(@Param("id") id: string) {
-        try {
-            const result = await this.buildingRepository.delete(id);
-            return result;
-        }
+        try {}
         catch (error) {
             throw new Error("Building not found to delete");
killedBy: BuildingController building should delete success building
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"affected": 1, "generatedMaps": [], "raw": []}
Received: undefined

[Timeout] BlockStatement
src/building/building.controller.ts:85:23
             const result = await this.buildingRepository.delete(id);
             return result;
         }
-        catch (error) {
-            throw new Error("Building not found to delete");
-            
-        }
+        catch (error) {}
     }
 }

[Timeout] StringLiteral
src/building/building.controller.ts:86:29
             return result;
         }
         catch (error) {
-            throw new Error("Building not found to delete");
+            throw new Error("");
             
         }
