[NoCoverage] BlockStatement
src/seed/seed.service.ts:44:25
         try {
             await this.storageManager.destroyStorage();
             await this.dataSource.dropDatabase();
-        } catch (error) {
-            throw new Error("error");
-            
-        }
+        } catch (error) {}
     }
     async createDB() {

[NoCoverage] StringLiteral
src/seed/seed.service.ts:45:29
             await this.storageManager.destroyStorage();
             await this.dataSource.dropDatabase();
         } catch (error) {
-            throw new Error("error");
+            throw new Error("");
             
         }

[Timeout] BlockStatement
src/seed/seed.service.ts:50:13
         }
     }
     async createDB() {
-        try {
-            await this.storageManager.initiateStorage();
-            await this.dataSource.synchronize();
-        } catch (error) {
+        try {} catch (error) {
             throw new Error("error");
         }

[NoCoverage] BlockStatement
src/seed/seed.service.ts:53:25
         try {
             await this.storageManager.initiateStorage();
             await this.dataSource.synchronize();
-        } catch (error) {
-            throw new Error("error");
-        }
+        } catch (error) {}
     }
     private readonly NUMBER_OF_BUILDING = 5;

[Timeout] ArrayDeclaration
src/seed/seed.service.ts:74:31
         buffer: readFileSync(process.cwd() + "/src/seed/back.jpg"),
     } as MemoryStoredFile;
 
-    private readonly images = [
-        {
-            buffer: readFileSync(process.cwd() + "/src/seed/room.jpg"),
-        } as MemoryStoredFile,
-        {
-            buffer: readFileSync(process.cwd() + "/src/seed/room (2).jpg"),
-        } as MemoryStoredFile,
-        {
-            buffer: readFileSync(process.cwd() + "/src/seed/room (3).jpg"),
-        } as MemoryStoredFile,
-        {
-            buffer: readFileSync(process.cwd() + "/src/seed/room (4).jpg"),
-        } as MemoryStoredFile,
-        {
-            buffer: readFileSync(process.cwd() + "/src/seed/room (5).jpg"),
-        } as MemoryStoredFile,
-    ];
+    private readonly images = [];
 
     async startSeeding() {

[Timeout] BlockStatement
src/seed/seed.service.ts:96:38
     }
     async createDemoApartments(floorInfo: any[]) {
         let apartmentIds: any[] = [];
-        for (let floor of floorInfo) {
-            for (let i = 0; i < this.NUMBER_OF_APARTMENT_PER_FLOOR; i++) {
-                apartmentIds.push(
-                    (
-                        await this.apartmentService.create({
-                            name: "St. Crytal",
-                            images: this.images,
-                            length: 20,
-                            building_id: floor.building_id,
-                            floor_id: floor.floor_id,
-                            width: 15,
-                            description: faker.lorem.paragraphs({
-                                min: 3,
-                                max: 5,
-                            }),
-                            number_of_bathroom: 2,
-                            number_of_bedroom: 1,
-                            rent: 9000000,
-                        })
-                    ).apartment_id,
-                );
-            }
-        }
+        for (let floor of floorInfo) {}
 
         

[Timeout] StringLiteral
src/seed/seed.service.ts:101:35
                 apartmentIds.push(
                     (
                         await this.apartmentService.create({
-                            name: "St. Crytal",
+                            name: "",
                             images: this.images,
                             length: 20,
