[Timeout] BlockStatement
src/token/token.controller.ts:20:21
         status: HttpStatus.UNAUTHORIZED,
         description: "Token invalid or expired",
     })
-    validateToken() {
-        return "Token is valid";
-    }
+    validateToken() {}
 
     @Post("/expiredToken")

[Timeout] BlockStatement
src/token/token.controller.ts:25:50
     }
 
     @Post("/expiredToken")
-    getExiredToken(@Body() signinDto: SignInDto) {
-        return this.authService.signIn(signinDto, "1s");
-    }
+    getExiredToken(@Body() signinDto: SignInDto) {}
 }
 

[Timeout] StringLiteral
src/token/token.controller.ts:26:51
 
     @Post("/expiredToken")
     getExiredToken(@Body() signinDto: SignInDto) {
-        return this.authService.signIn(signinDto, "1s");
+        return this.authService.signIn(signinDto, "");
     }
 }
