[Timeout] BlockStatement
src/seed/seed.controller.ts:11:20
     constructor(private readonly seedService: SeedService) {}
     @ApiOperation({ summary: "Create data" })
     @Post("/start")
-    startSeeding() {
-        return this.seedService.startSeeding();
-    }
+    startSeeding() {}
     @ApiOperation({ summary: "Init database" })
     @Post("/create")
