[Killed] ConditionalExpression
src/apartment/isURLOrImageFile.ts:49:17
             ]);
             return true;
         } catch (error) {
-            if (error instanceof AggregateError) {
+            if (false) {
                 throw new BadRequestException({
                     message: `${validationArguments?.property} fail to validate any of the following constrains`,
killedBy: ApartmentService should service be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.
