[Timeout] BlockStatement
src/storage/storage.service.ts:52:14
 export class StorageError extends Error {
     constructor(objOrString: Partial<StorageError> | string) {
         if (isString(objOrString)) super(objOrString as string);
-        else {
-            super(objOrString.message);
-            Object.assign(this, objOrString);
-            Object.setPrototypeOf(this, StorageError.prototype);
-        }
+        else {}
     }
 }

[Timeout] BlockStatement
src/storage/storage.service.ts:69:26
         super();
     }
 
-    async onModuleInit() {
-        this.BUCKET_URL_PREFIX = this.supabaseClient.storage
-            .from(this.BUCKET_NAME)
-            .getPublicUrl("").data.publicUrl;
-    }
+    async onModuleInit() {}
 
     private BUCKET_URL_PREFIX = "";

[Timeout] StringLiteral
src/storage/storage.service.ts:72:27
     async onModuleInit() {
         this.BUCKET_URL_PREFIX = this.supabaseClient.storage
             .from(this.BUCKET_NAME)
-            .getPublicUrl("").data.publicUrl;
+            .getPublicUrl("Stryker was here!").data.publicUrl;
     }
 

[Timeout] BlockStatement
src/storage/storage.service.ts:78:28
     private BUCKET_URL_PREFIX = "";
     private readonly BUCKET_NAME = "homeland";
 
-    async destroyStorage() {
-        await this.supabaseClient.storage.emptyBucket(this.BUCKET_NAME);
-        await this.supabaseClient.storage.deleteBucket(this.BUCKET_NAME);
-    }
+    async destroyStorage() {}
 
     async initiateStorage() {

[Timeout] BlockStatement
src/storage/storage.service.ts:83:29
         await this.supabaseClient.storage.deleteBucket(this.BUCKET_NAME);
     }
 
-    async initiateStorage() {
-        await this.supabaseClient.storage.createBucket(this.BUCKET_NAME, {
-            public: true,
-        });
-
-    }
+    async initiateStorage() {}
     
     // async copy(oldPath: string, newPath: string): Promise<string> {

[Timeout] BooleanLiteral
src/storage/storage.service.ts:85:21
 
     async initiateStorage() {
         await this.supabaseClient.storage.createBucket(this.BUCKET_NAME, {
-            public: true,
+            public: false,
         });
 

[Timeout] ConditionalExpression
src/storage/storage.service.ts:104:13
     // }
 
     async remove(pathsOrURLs: string[]): Promise<boolean> {
-        if (pathsOrURLs.length === 0) return true;
+        if (false) return true;
         console.log(
             pathsOrURLs.map(

[Timeout] BooleanLiteral
src/storage/storage.service.ts:104:46
     // }
 
     async remove(pathsOrURLs: string[]): Promise<boolean> {
-        if (pathsOrURLs.length === 0) return true;
+        if (pathsOrURLs.length === 0) return false;
         console.log(
             pathsOrURLs.map(

[Timeout] ConditionalExpression
src/storage/storage.service.ts:107:27
         if (pathsOrURLs.length === 0) return true;
         console.log(
             pathsOrURLs.map(
-                (path) => this.extractFilePathFromPublicUrl(path) || path,
+                (path) => false,
             ),
         );

[Timeout] ArrowFunction
src/storage/storage.service.ts:107:17
         if (pathsOrURLs.length === 0) return true;
         console.log(
             pathsOrURLs.map(
-                (path) => this.extractFilePathFromPublicUrl(path) || path,
+                () => undefined,
             ),
         );

[Timeout] ConditionalExpression
src/storage/storage.service.ts:123:13
             );
 
         if (error) throw new StorageError(error);
-        if (data && data.length > 0) return true;
+        if (false) return true;
         return false;
     }

[Timeout] ConditionalExpression
src/storage/storage.service.ts:123:13
             );
 
         if (error) throw new StorageError(error);
-        if (data && data.length > 0) return true;
+        if (true) return true;
         return false;
     }

[Timeout] BooleanLiteral
src/storage/storage.service.ts:124:16
 
         if (error) throw new StorageError(error);
         if (data && data.length > 0) return true;
-        return false;
+        return true;
     }
 

[Timeout] ConditionalExpression
src/storage/storage.service.ts:135:13
     private async extractFilePathFromPublicUrl(
         url: string,
     ): Promise<string | undefined> {
-        if (url.indexOf(this.BUCKET_URL_PREFIX) !== 0) {
+        if (true) {
             return undefined;
         }

[Timeout] BlockStatement
src/storage/storage.service.ts:135:56
     private async extractFilePathFromPublicUrl(
         url: string,
     ): Promise<string | undefined> {
-        if (url.indexOf(this.BUCKET_URL_PREFIX) !== 0) {
-            return undefined;
-        }
+        if (url.indexOf(this.BUCKET_URL_PREFIX) !== 0) {}
         const restOfPath = url.slice(this.BUCKET_URL_PREFIX.length);
         return restOfPath;

[Timeout] MethodExpression
src/storage/storage.service.ts:138:28
         if (url.indexOf(this.BUCKET_URL_PREFIX) !== 0) {
             return undefined;
         }
-        const restOfPath = url.slice(this.BUCKET_URL_PREFIX.length);
+        const restOfPath = url;
         return restOfPath;
     }

[Timeout] BooleanLiteral
src/storage/storage.service.ts:147:13
         uploadPath: string,
         mime: string = "text/plain;charset=UTF-8",
     ): Promise<string> {
-        if (!file) throw new Error("File must have buffer property");
+        if (file) throw new Error("File must have buffer property");
         const { error } = await this.supabaseClient.storage
             .from(this.BUCKET_NAME)

[Timeout] ConditionalExpression
src/storage/storage.service.ts:147:13
         uploadPath: string,
         mime: string = "text/plain;charset=UTF-8",
     ): Promise<string> {
-        if (!file) throw new Error("File must have buffer property");
+        if (false) throw new Error("File must have buffer property");
         const { error } = await this.supabaseClient.storage
             .from(this.BUCKET_NAME)
