[Timeout] BlockStatement
src/helper/validation/index.ts:3:39
 import { DeleteResult, UpdateResult } from "typeorm";
 
-export function MBtoBytes(mb: number) {
-    return mb * 1000000;
-}
+export function MBtoBytes(mb: number) {}
 
 export function isQueryAffected(result: UpdateResult | DeleteResult): boolean {

[Timeout] ArithmeticOperator
src/helper/validation/index.ts:4:12
 import { DeleteResult, UpdateResult } from "typeorm";
 
 export function MBtoBytes(mb: number) {
-    return mb * 1000000;
+    return mb / 1000000;
 }
 

[Timeout] BooleanLiteral
src/helper/validation/index.ts:8:56
 }
 
 export function isQueryAffected(result: UpdateResult | DeleteResult): boolean {
-    if (result.affected && result.affected > 0) return true;
+    if (result.affected && result.affected > 0) return false;
     return false;
 }

[Timeout] ConditionalExpression
src/helper/validation/index.ts:8:9
 }
 
 export function isQueryAffected(result: UpdateResult | DeleteResult): boolean {
-    if (result.affected && result.affected > 0) return true;
+    if (false) return true;
     return false;
 }

[Timeout] BooleanLiteral
src/helper/validation/index.ts:9:12
 
 export function isQueryAffected(result: UpdateResult | DeleteResult): boolean {
     if (result.affected && result.affected > 0) return true;
-    return false;
+    return true;
 }
 
