[Timeout] ConditionalExpression
src/helper/guard/role.guard.ts:19:13
             context.getHandler(),
             context.getClass(),
         ]);
-        if (!roles || roles.length === 0) {
+        if (false) {
             return true;
         }

[Timeout] LogicalOperator
src/helper/guard/role.guard.ts:25:30
         const request = context.switchToHttp().getRequest();
         const user = request.user;
         const hasRole = () => roles.includes(user.role);
-        const hasAuthority = user && user.role && hasRole();
+        const hasAuthority = user || user.role && hasRole();
         if (hasAuthority) return true;
         throw new ForbiddenException(

[Timeout] BooleanLiteral
src/helper/guard/role.guard.ts:26:34
         const user = request.user;
         const hasRole = () => roles.includes(user.role);
         const hasAuthority = user && user.role && hasRole();
-        if (hasAuthority) return true;
+        if (hasAuthority) return false;
         throw new ForbiddenException(
             "Only " + roles.join(", ") + " have permission",

[Timeout] ConditionalExpression
src/helper/guard/role.guard.ts:26:13
         const user = request.user;
         const hasRole = () => roles.includes(user.role);
         const hasAuthority = user && user.role && hasRole();
-        if (hasAuthority) return true;
+        if (true) return true;
         throw new ForbiddenException(
             "Only " + roles.join(", ") + " have permission",
