[Survived] ConditionalExpression
src/helper/filter/typeorm-exception.filter.ts:36:13
         let status = HttpStatus.INTERNAL_SERVER_ERROR;
 
         switch (exception.constructor) {
-            case HttpException:
-                status = (exception as HttpException).getStatus();
-                break;
+            case HttpException:
             case QueryFailedError: // this is a TypeOrm error
                 status = HttpStatus.UNPROCESSABLE_ENTITY;

[Survived] ConditionalExpression
src/helper/filter/typeorm-exception.filter.ts:39:13
             case HttpException:
                 status = (exception as HttpException).getStatus();
                 break;
-            case QueryFailedError: // this is a TypeOrm error
-                status = HttpStatus.UNPROCESSABLE_ENTITY;
-                message = (exception as QueryFailedError).message;
-                code = (exception as any).code;
-                break;
+            case QueryFailedError:
             case EntityNotFoundError: // this is another TypeOrm error
                 status = HttpStatus.UNPROCESSABLE_ENTITY;

[Survived] ConditionalExpression
src/helper/filter/typeorm-exception.filter.ts:44:13
                 message = (exception as QueryFailedError).message;
                 code = (exception as any).code;
                 break;
-            case EntityNotFoundError: // this is another TypeOrm error
-                status = HttpStatus.UNPROCESSABLE_ENTITY;
-                message = (exception as EntityNotFoundError).message;
-                code = (exception as any).code;
-                break;
+            case EntityNotFoundError:
             case CannotCreateEntityIdMapError: // and another
                 status = HttpStatus.UNPROCESSABLE_ENTITY;

[Survived] ConditionalExpression
src/helper/filter/typeorm-exception.filter.ts:49:13
                 message = (exception as EntityNotFoundError).message;
                 code = (exception as any).code;
                 break;
-            case CannotCreateEntityIdMapError: // and another
-                status = HttpStatus.UNPROCESSABLE_ENTITY;
-                message = (exception as CannotCreateEntityIdMapError).message;
-                code = (exception as any).code;
-                break;
+            case CannotCreateEntityIdMapError:
             default:
                 status = HttpStatus.INTERNAL_SERVER_ERROR;

[Survived] ConditionalExpression
src/helper/filter/typeorm-exception.filter.ts:54:13
                 message = (exception as CannotCreateEntityIdMapError).message;
                 code = (exception as any).code;
                 break;
-            default:
-                status = HttpStatus.INTERNAL_SERVER_ERROR;
+            default:
         }
         response
