[Timeout] ConditionalExpression
src/resident/resident.service.ts:97:22
                 "resident/" +
                     resident.id +
                     "/front_identify_card_photo_URL." +
-                    (frontPhoto.extension || "png"),
+                    (false),
                 frontPhoto.mimetype || "image/png",
             );

[Timeout] LogicalOperator
src/resident/resident.service.ts:98:17
                     resident.id +
                     "/front_identify_card_photo_URL." +
                     (frontPhoto.extension || "png"),
-                frontPhoto.mimetype || "image/png",
+                frontPhoto.mimetype && "image/png",
             );
             const backURL = await this.storageManager.upload(

[Timeout] StringLiteral
src/resident/resident.service.ts:102:17
             );
             const backURL = await this.storageManager.upload(
                 backPhoto.buffer,
-                "resident/" +
+                "" +
                     resident.id +
                     "/back_identify_card_photo_URL." +

[Timeout] ConditionalExpression
src/resident/resident.service.ts:105:22
                 "resident/" +
                     resident.id +
                     "/back_identify_card_photo_URL." +
-                    (backPhoto.extension || "png"),
+                    (false),
                 backPhoto.mimetype || "image/png",
             );

[Timeout] ConditionalExpression
src/resident/resident.service.ts:105:22
                 "resident/" +
                     resident.id +
                     "/back_identify_card_photo_URL." +
-                    (backPhoto.extension || "png"),
+                    (true),
                 backPhoto.mimetype || "image/png",
             );

[Timeout] LogicalOperator
src/resident/resident.service.ts:106:17
                     resident.id +
                     "/back_identify_card_photo_URL." +
                     (backPhoto.extension || "png"),
-                backPhoto.mimetype || "image/png",
+                backPhoto.mimetype && "image/png",
             );
             let avatarURL: string | undefined;

[Killed] ConditionalExpression
src/resident/resident.service.ts:111:17
             let avatarURL: string | undefined;
             // const avatarPhoto = avatar_photo as MemoryStoredFile;
 
-            if (avatar_photo) {
+            if (false) {
                 const avataPhoto = avatar_photo as MemoryStoredFile;
                 avatarURL = await this.storageManager.upload(
killedBy: AppController should be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.

[Timeout] ConditionalExpression
src/resident/resident.service.ts:111:17
             let avatarURL: string | undefined;
             // const avatarPhoto = avatar_photo as MemoryStoredFile;
 
-            if (avatar_photo) {
+            if (true) {
                 const avataPhoto = avatar_photo as MemoryStoredFile;
                 avatarURL = await this.storageManager.upload(

[Timeout] ConditionalExpression
src/resident/resident.service.ts:118:26
                     "resident/" +
                         resident.id +
                         "/avatarURL." +
-                        (avataPhoto.extension || "png"),
+                        (true),
                     avataPhoto.mimetype || "image/png",
                 );

[Timeout] ConditionalExpression
src/resident/resident.service.ts:118:26
                     "resident/" +
                         resident.id +
                         "/avatarURL." +
-                        (avataPhoto.extension || "png"),
+                        (false),
                     avataPhoto.mimetype || "image/png",
                 );

[Timeout] LogicalOperator
src/resident/resident.service.ts:119:21
                         resident.id +
                         "/avatarURL." +
                         (avataPhoto.extension || "png"),
-                    avataPhoto.mimetype || "image/png",
+                    avataPhoto.mimetype && "image/png",
                 );
             } else {

[Timeout] StringLiteral
src/resident/resident.service.ts:128:21
                 );
                 avatarURL = await this.storageManager.upload(
                     avatar,
-                    "resident/" + resident.id + "/avatarURL.svg",
+                    "" + resident.id + "/avatarURL.svg",
                     "image/svg+xml",
                 );

[Timeout] ConditionalExpression
src/resident/resident.service.ts:150:17
             }
             return residentData
         } catch (error) {
-            if (error instanceof TypeORMError) {
+            if (false) {
                 try {
                     await this.storageManager.remove([

[Timeout] StringLiteral
src/resident/resident.service.ts:153:25
             if (error instanceof TypeORMError) {
                 try {
                     await this.storageManager.remove([
-                        "/resident/" +
+                        "" +
                             resident.id +
                             "/front_identify_card_photo_URL.png",

[Timeout] ObjectLiteral
src/resident/resident.service.ts:181:20
         updateResidentDto: UpdateResidentDto,
     ): Promise<Resident> {
         let resident = await this.residentRepository.findOne({
-            where: { id },
+            where: {},
         });
         console.log(updateResidentDto);

[Killed] ConditionalExpression
src/resident/resident.service.ts:194:13
         resident.payment_info = payment_info;
         let profile = plainToInstance(Profile, rest);
         let avatarURL: string | undefined;
-        if (avatar_photo) {
+        if (true) {
             const avataPhoto = avatar_photo as MemoryStoredFile;
             avatarURL = await this.storageManager.upload(
killedBy: ResidentController resident should update success resident without avata photo
statusReason: TypeError: Cannot read properties of undefined (reading 'buffer')

[Timeout] LogicalOperator
src/resident/resident.service.ts:201:22
                 "resident/" +
                     resident.id +
                     "/avatarURL." +
-                    (avataPhoto.extension || "png"),
+                    (avataPhoto.extension && "png"),
                 avataPhoto.mimetype || "image/png",
             );

[Timeout] ObjectLiteral
src/resident/resident.service.ts:216:48
         return await this.residentRepository.save(resident);
     }
     findOne(id: string): Promise<Resident | null> {
-        return this.residentRepository.findOne({
-            where: {
-                id,
-            },
-            cache: true,
-            relations: ["account"],
-        });
+        return this.residentRepository.findOne({});
     }
 

[Timeout] BooleanLiteral
src/resident/resident.service.ts:220:20
             where: {
                 id,
             },
-            cache: true,
+            cache: false,
             relations: ["account"],
         });

[Timeout] ArrayDeclaration
src/resident/resident.service.ts:221:24
                 id,
             },
             cache: true,
-            relations: ["account"],
+            relations: [],
         });
     }

[Timeout] BlockStatement
src/resident/resident.service.ts:234:68
     //     });
     // }
 
-    async update(id: string, UpdateResidentDto: UpdateResidentDto) {
-            let result = await this.residentRepository.update(
-                id,
-                UpdateResidentDto,
-            );
-            return result
-       
-    }
+    async update(id: string, UpdateResidentDto: UpdateResidentDto) {}
 
     async delete(id: string) {

[Timeout] BlockStatement
src/resident/resident.service.ts:244:13
     }
 
     async delete(id: string) {
-        try {
-            const result = await this.residentRepository.softDelete({ id });
-            return result;
-        }
+        try {}
         catch(err) {
             throw new Error("Can not delete resident")

[Timeout] BlockStatement
src/resident/resident.service.ts:248:20
             const result = await this.residentRepository.softDelete({ id });
             return result;
         }
-        catch(err) {
-            throw new Error("Can not delete resident")
-        }
+        catch(err) {}
         
        
