[Killed] BlockStatement
src/contract/contract.service.ts:31:34
         //await this.findOne(contract.contract_id);
     }
 
-    async findAll(page?: number) {
-        if (page != undefined && page != null && page > 0) {
-            return await this.contractRepository.find({
-                skip: (page - 1) * 30,
-                take: 30,
-                relations: ["resident", "apartment"],
-                cache: true,
-            });
-        }
-
-        return await this.contractRepository.find({
-            relations: ["resident", "apartment"],
-            cache: true,
-        });
-    }
+    async findAll(page?: number) {}
 
     async findOne(id: string): Promise<Contract> {
killedBy: ContractService should be defined
statusReason: Error: thrown: "Exceeded timeout of 30000 ms for a hook.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] LogicalOperator
src/contract/contract.service.ts:32:13
     }
 
     async findAll(page?: number) {
-        if (page != undefined && page != null && page > 0) {
+        if (page != undefined || page != null && page > 0) {
             return await this.contractRepository.find({
                 skip: (page - 1) * 30,
killedBy: AppController should be defined
statusReason: Error: thrown: "Exceeded timeout of 30000 ms for a hook.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ConditionalExpression
src/contract/contract.service.ts:32:13
     }
 
     async findAll(page?: number) {
-        if (page != undefined && page != null && page > 0) {
+        if (true && page != null && page > 0) {
             return await this.contractRepository.find({
                 skip: (page - 1) * 30,

[Killed] ObjectLiteral
src/contract/contract.service.ts:41:51
             });
         }
 
-        return await this.contractRepository.find({
-            relations: ["resident", "apartment"],
-            cache: true,
-        });
+        return await this.contractRepository.find({});
     }
 
killedBy: ContractService should be defined
statusReason: Error: thrown: "Exceeded timeout of 30000 ms for a hook.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ConditionalExpression
src/contract/contract.service.ts:79:21
                 contract = await this.contractRepository.save(contract);
                 await queryRunner.commitTransaction();
             } catch (error) {
-                if (error instanceof TypeORMError) {
+                if (true) {
                     try {
                         await this.storageManager.remove([

[Survived] StringLiteral
src/contract/contract.service.ts:82:29
                 if (error instanceof TypeORMError) {
                     try {
                         await this.storageManager.remove([
-                            `contract/${id}/${Date.now()}.` +
+                            `` +
                                 (imageUpdate.extension || "png"),
                             imageUpdate.mimetype || "image/png",

[Survived] ConditionalExpression
src/contract/contract.service.ts:83:34
                     try {
                         await this.storageManager.remove([
                             `contract/${id}/${Date.now()}.` +
-                                (imageUpdate.extension || "png"),
+                                (true),
                             imageUpdate.mimetype || "image/png",
                         ]);

[Survived] StringLiteral
src/contract/contract.service.ts:84:53
                         await this.storageManager.remove([
                             `contract/${id}/${Date.now()}.` +
                                 (imageUpdate.extension || "png"),
-                            imageUpdate.mimetype || "image/png",
+                            imageUpdate.mimetype || "",
                         ]);
                     } catch (error) {

[Survived] BlockStatement
src/contract/contract.service.ts:91:23
                     }
                 }
                 throw error;
-            } finally {
-                await queryRunner.release();
-            }
+            } finally {}
         }
         let result = await this.contractRepository.update(
