[Timeout] StringLiteral
src/apartment/apartment.service.ts:76:34
     ): Promise<Apartment> {
         const { images, ...rest } = createApartmentDto;
         let apartment = this.apartmentRepository.create(rest);
-        apartment.apartment_id = "APM" + this.idGenerate.generateId();
+        apartment.apartment_id = "" + this.idGenerate.generateId();
         if (id) apartment.apartment_id = id;
         const queryRunnder = this.dataSource.createQueryRunner();

[Timeout] LogicalOperator
src/apartment/apartment.service.ts:88:51
                     this.storageManager.upload(
                         image.buffer,
                         `apartment/${apartment.apartment_id}/${
-                            index + Date.now() + (image.extension || ".png")
+                            index + Date.now() + (image.extension && ".png")
                         }`,
                         `image/${image.extension}` || "image/png",

[Timeout] ArithmeticOperator
src/apartment/apartment.service.ts:88:29
                     this.storageManager.upload(
                         image.buffer,
                         `apartment/${apartment.apartment_id}/${
-                            index + Date.now() + (image.extension || ".png")
+                            index - Date.now() + (image.extension || ".png")
                         }`,
                         `image/${image.extension}` || "image/png",

[Killed] LogicalOperator
src/apartment/apartment.service.ts:90:25
                         `apartment/${apartment.apartment_id}/${
                             index + Date.now() + (image.extension || ".png")
                         }`,
-                        `image/${image.extension}` || "image/png",
+                        `image/${image.extension}` && "image/png",
                     ),
                 ),
killedBy: ApartmentService should service be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.

[Timeout] StringLiteral
src/apartment/apartment.service.ts:90:55
                         `apartment/${apartment.apartment_id}/${
                             index + Date.now() + (image.extension || ".png")
                         }`,
-                        `image/${image.extension}` || "image/png",
+                        `image/${image.extension}` || "",
                     ),
                 ),

[Timeout] ObjectLiteral
src/apartment/apartment.service.ts:102:70
             apartment.imageURLs = uploadResults.map((result) => result.value);
 
             if (createApartmentDto.residentIds) {
-                const residents = await this.residentRepository.find({
-                    where: { id: In(createApartmentDto.residentIds) },
-                });
+                const residents = await this.residentRepository.find({});
                 if (residents.length !== createApartmentDto.residentIds.length)
                     throw new NotFoundException("Some resident not found");

[Timeout] EqualityOperator
src/apartment/apartment.service.ts:105:21
                 const residents = await this.residentRepository.find({
                     where: { id: In(createApartmentDto.residentIds) },
                 });
-                if (residents.length !== createApartmentDto.residentIds.length)
+                if (residents.length === createApartmentDto.residentIds.length)
                     throw new NotFoundException("Some resident not found");
                 apartment.residents = residents;

[Timeout] BlockStatement
src/apartment/apartment.service.ts:125:19
 
             console.error(error);
             throw error;
-        } finally {
-            await queryRunnder.release();
-        }
+        } finally {}
     }
 

[Killed] LogicalOperator
src/apartment/apartment.service.ts:131:13
     }
 
     async findAll(page?: number) {
-        if (page != undefined && page != null) {
+        if (page != undefined || page != null) {
             return await this.apartmentRepository.find({
                 skip: (page - 1) * 30,
killedBy: AppController should be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.

[Killed] ConditionalExpression
src/apartment/apartment.service.ts:131:34
     }
 
     async findAll(page?: number) {
-        if (page != undefined && page != null) {
+        if (page != undefined && true) {
             return await this.apartmentRepository.find({
                 skip: (page - 1) * 30,
killedBy: ApartmentService should service be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.

[Timeout] ArithmeticOperator
src/apartment/apartment.service.ts:133:23
     async findAll(page?: number) {
         if (page != undefined && page != null) {
             return await this.apartmentRepository.find({
-                skip: (page - 1) * 30,
+                skip: (page - 1) / 30,
                 take: 30,
             });

[Timeout] ObjectLiteral
src/apartment/apartment.service.ts:156:68
         try {
             queryRunnder.startTransaction();
             let { images, ...rest } = updateApartmentDto;
-            let apartment = await this.apartmentRepository.preload({
-                apartment_id: id,
-                ...rest,
-            });
+            let apartment = await this.apartmentRepository.preload({});
 
             if (!apartment) throw new NotFoundException("Apartment Not found");

[Timeout] LogicalOperator
src/apartment/apartment.service.ts:171:51
                     images.map((element, index) => {
                         if (isString(element)) return element;
                         const uploadPath = `apartment/${id}/${
-                            index + Date.now() + (element.extension || ".png")
+                            index + Date.now() + (element.extension && ".png")
                         }`;
                         uploadPaths.push(uploadPath);

[Timeout] LogicalOperator
src/apartment/apartment.service.ts:177:29
                         return this.storageManager.upload(
                             element.buffer,
                             uploadPath,
-                            `image/${element.extension}` || ".png",
+                            `image/${element.extension}` && ".png",
                         );
                     }),

[Timeout] StringLiteral
src/apartment/apartment.service.ts:177:29
                         return this.storageManager.upload(
                             element.buffer,
                             uploadPath,
-                            `image/${element.extension}` || ".png",
+                            `` || ".png",
                         );
                     }),

[Killed] EqualityOperator
src/apartment/apartment.service.ts:197:17
         return isQueryAffected(result);
         } catch (error) {
             await queryRunnder.rollbackTransaction();
-            if (uploadPaths.length > 0)
+            if (uploadPaths.length <= 0)
                 await this.storageManager.remove(uploadPaths);
             console.error(error);
killedBy: ApartmentService Aparment Create newImageHaveStrangeURL should return false if there are no new images
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.

[Timeout] EqualityOperator
src/apartment/apartment.service.ts:197:17
         return isQueryAffected(result);
         } catch (error) {
             await queryRunnder.rollbackTransaction();
-            if (uploadPaths.length > 0)
+            if (uploadPaths.length >= 0)
                 await this.storageManager.remove(uploadPaths);
             console.error(error);

[Timeout] EqualityOperator
src/apartment/apartment.service.ts:210:16
     private isPromiseFulfilledResult<T>(
         result: PromiseSettledResult<T>,
     ): result is PromiseFulfilledResult<T> {
-        return result.status === "fulfilled";
+        return result.status !== "fulfilled";
     }
 

[Timeout] ArrowFunction
src/apartment/apartment.service.ts:216:30
     private isPromiseFulfilledResultArray<T>(
         results: PromiseSettledResult<T>[],
     ): results is PromiseFulfilledResult<T>[] {
-        return results.every((result) => result.status === "fulfilled");
+        return results.every(() => undefined);
     }
 

[Timeout] EqualityOperator
src/apartment/apartment.service.ts:216:42
     private isPromiseFulfilledResultArray<T>(
         results: PromiseSettledResult<T>[],
     ): results is PromiseFulfilledResult<T>[] {
-        return results.every((result) => result.status === "fulfilled");
+        return results.every((result) => result.status !== "fulfilled");
     }
 

[Timeout] MethodExpression
src/apartment/apartment.service.ts:223:30
         newImages: (string | MemoryStoredFile)[],
         oldImageURLS: string[],
     ) {
-        const newImageURLS = newImages.filter((image): image is string =>
-            isString(image),
-        );
+        const newImageURLS = newImages;
 
         if (difference(newImageURLS, oldImageURLS).length > 0) return true;

[Timeout] EqualityOperator
src/apartment/apartment.service.ts:227:13
             isString(image),
         );
 
-        if (difference(newImageURLS, oldImageURLS).length > 0) return true;
+        if (difference(newImageURLS, oldImageURLS).length <= 0) return true;
         return false;
     }

[Timeout] ConditionalExpression
src/apartment/apartment.service.ts:227:13
             isString(image),
         );
 
-        if (difference(newImageURLS, oldImageURLS).length > 0) return true;
+        if (true) return true;
         return false;
     }

[Timeout] BooleanLiteral
src/apartment/apartment.service.ts:228:16
         );
 
         if (difference(newImageURLS, oldImageURLS).length > 0) return true;
-        return false;
+        return true;
     }
     async delete(id: string) {

[Timeout] BlockStatement
src/apartment/apartment.service.ts:230:30
         if (difference(newImageURLS, oldImageURLS).length > 0) return true;
         return false;
     }
-    async delete(id: string) {
-        return await this.apartmentRepository.softDelete({
-            apartment_id: id,
-        });
-    }
+    async delete(id: string) {}
 }
 

[Timeout] ObjectLiteral
src/apartment/apartment.service.ts:231:58
         return false;
     }
     async delete(id: string) {
-        return await this.apartmentRepository.softDelete({
-            apartment_id: id,
-        });
+        return await this.apartmentRepository.softDelete({});
     }
 }
