[Killed] StringLiteral
src/building/building.service.ts:67:41
             });
             return building;
         } catch (e) {
-            throw new NotFoundException("Not found building");
+            throw new NotFoundException("");
         }
     }
killedBy: BuildingService building should not find building by id
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Not found building"
Received message: "Not Found"

      131 |         } else {
      132 |           stryCov_9fa48("301");
    > 133 |           throw new NotFoundException(stryMutAct_9fa48("302") ? "" : (stryCov_9fa48("302"), "Not found building"));

[Survived] BlockStatement
src/building/building.service.ts:77:25
                 updateBuildingDto,
             );
             return result;
-        } catch (error) {
-            throw new BadRequestException("Id not found.");
-        }
+        } catch (error) {}
     }
     async delete(id: string) {

[Killed] StringLiteral
src/building/building.service.ts:88:29
             });
             return result;
         } catch (error) {
-            throw new Error("can not delete");
+            throw new Error("");
         }
     }
killedBy: AppController should be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.
