[Killed] BlockStatement
src/account/account.controller.ts:15:15
     }
 
     @Get()
-    findAll() {
-        return this.accountService.findAll();
-    }
+    findAll() {}
 
     @Get(":id")
killedBy: AccountController account should find all account
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "This action returns all account"
Received: undefined

[Killed] BlockStatement
src/account/account.controller.ts:20:38
     }
 
     @Get(":id")
-    findOne(@Param("id") id: string) {
-        return this.accountService.findOne(id);
-    }
+    findOne(@Param("id") id: string) {}
 
     @Delete(":id")
killedBy: AppController should be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.
