[Timeout] BlockStatement
src/account/entities/account.entity.ts:72:46
 
     @BeforeUpdate()
     @BeforeInsert()
-    async checkIfAccountIsHasMultipleOwner() {
-        let owners: any[] = [];
-        if (this.resident) owners.push(this.resident);
-        if (this.admin) owners.push(this.admin);
-        if (this.technician) owners.push(this.technician);
-        if (this.manager) owners.push(this.manager);    
-        if (owners.length != 1) {
-            throw new Error("Account must have only one owner");
-        }
-    }
+    async checkIfAccountIsHasMultipleOwner() {}
 }
 

[Timeout] ConditionalExpression
src/account/entities/account.entity.ts:74:13
     @BeforeInsert()
     async checkIfAccountIsHasMultipleOwner() {
         let owners: any[] = [];
-        if (this.resident) owners.push(this.resident);
+        if (false) owners.push(this.resident);
         if (this.admin) owners.push(this.admin);
         if (this.technician) owners.push(this.technician);

[Timeout] ConditionalExpression
src/account/entities/account.entity.ts:74:13
     @BeforeInsert()
     async checkIfAccountIsHasMultipleOwner() {
         let owners: any[] = [];
-        if (this.resident) owners.push(this.resident);
+        if (true) owners.push(this.resident);
         if (this.admin) owners.push(this.admin);
         if (this.technician) owners.push(this.technician);

[Timeout] ConditionalExpression
src/account/entities/account.entity.ts:75:13
     async checkIfAccountIsHasMultipleOwner() {
         let owners: any[] = [];
         if (this.resident) owners.push(this.resident);
-        if (this.admin) owners.push(this.admin);
+        if (false) owners.push(this.admin);
         if (this.technician) owners.push(this.technician);
         if (this.manager) owners.push(this.manager);    

[Timeout] ConditionalExpression
src/account/entities/account.entity.ts:75:13
     async checkIfAccountIsHasMultipleOwner() {
         let owners: any[] = [];
         if (this.resident) owners.push(this.resident);
-        if (this.admin) owners.push(this.admin);
+        if (true) owners.push(this.admin);
         if (this.technician) owners.push(this.technician);
         if (this.manager) owners.push(this.manager);    

[Timeout] ConditionalExpression
src/account/entities/account.entity.ts:76:13
         let owners: any[] = [];
         if (this.resident) owners.push(this.resident);
         if (this.admin) owners.push(this.admin);
-        if (this.technician) owners.push(this.technician);
+        if (true) owners.push(this.technician);
         if (this.manager) owners.push(this.manager);    
         if (owners.length != 1) {

[Timeout] ConditionalExpression
src/account/entities/account.entity.ts:76:13
         let owners: any[] = [];
         if (this.resident) owners.push(this.resident);
         if (this.admin) owners.push(this.admin);
-        if (this.technician) owners.push(this.technician);
+        if (false) owners.push(this.technician);
         if (this.manager) owners.push(this.manager);    
         if (owners.length != 1) {

[Timeout] ConditionalExpression
src/account/entities/account.entity.ts:77:13
         if (this.resident) owners.push(this.resident);
         if (this.admin) owners.push(this.admin);
         if (this.technician) owners.push(this.technician);
-        if (this.manager) owners.push(this.manager);    
+        if (true) owners.push(this.manager);    
         if (owners.length != 1) {
             throw new Error("Account must have only one owner");

[Timeout] ConditionalExpression
src/account/entities/account.entity.ts:77:13
         if (this.resident) owners.push(this.resident);
         if (this.admin) owners.push(this.admin);
         if (this.technician) owners.push(this.technician);
-        if (this.manager) owners.push(this.manager);    
+        if (false) owners.push(this.manager);    
         if (owners.length != 1) {
             throw new Error("Account must have only one owner");

[Timeout] ConditionalExpression
src/account/entities/account.entity.ts:78:13
         if (this.admin) owners.push(this.admin);
         if (this.technician) owners.push(this.technician);
         if (this.manager) owners.push(this.manager);    
-        if (owners.length != 1) {
+        if (true) {
             throw new Error("Account must have only one owner");
         }

[Timeout] EqualityOperator
src/account/entities/account.entity.ts:78:13
         if (this.admin) owners.push(this.admin);
         if (this.technician) owners.push(this.technician);
         if (this.manager) owners.push(this.manager);    
-        if (owners.length != 1) {
+        if (owners.length == 1) {
             throw new Error("Account must have only one owner");
         }

[Timeout] StringLiteral
src/account/entities/account.entity.ts:79:29
         if (this.technician) owners.push(this.technician);
         if (this.manager) owners.push(this.manager);    
         if (owners.length != 1) {
-            throw new Error("Account must have only one owner");
+            throw new Error("");
         }
     }
