[Timeout] BlockStatement
src/resident/resident.controller.ts:57:64
     })
     @Post()
     @FormDataRequest()
-    async create(@Body() createResidentDto: CreateResidentDto) {
-        return await this.residentRepository.create(createResidentDto);
-    }
+    async create(@Body() createResidentDto: CreateResidentDto) {}
     @Get("/search")
     async searchResident(@Query("query") query: string) {

[Timeout] BlockStatement
src/resident/resident.controller.ts:67:13
     }
     @Delete("/:id")
     async softDeleteResident(@Param("id") id: string) {
-        try {
-            const result = await this.residentRepository.delete(id);
-            return result;
-        } catch (error) {
+        try {} catch (error) {
             throw new Error("Resident not found to delete");
         }

[Timeout] BlockStatement
src/resident/resident.controller.ts:70:25
         try {
             const result = await this.residentRepository.delete(id);
             return result;
-        } catch (error) {
-            throw new Error("Resident not found to delete");
-        }
+        } catch (error) {}
     }
     /**
