[Survived] StringLiteral
src/main.ts:20:50
 
 async function bootstrap() {
     const app = await NestFactory.create<NestExpressApplication>(AppModule);
-    app.useStaticAssets(path.join(process.cwd(), "doc"));
+    app.useStaticAssets(path.join(process.cwd(), ""));
     app.useGlobalPipes(
         new ValidationPipe({

[Survived] ObjectLiteral
src/main.ts:22:28
     const app = await NestFactory.create<NestExpressApplication>(AppModule);
     app.useStaticAssets(path.join(process.cwd(), "doc"));
     app.useGlobalPipes(
-        new ValidationPipe({
-            whitelist: true,
-            forbidNonWhitelisted: true,
-            transform: true,
-        }),
+        new ValidationPipe({}),
     );
     app.enableCors();

[Survived] StringLiteral
src/main.ts:35:19
     app.useGlobalFilters(new TypeOrmExceptionFilter());
 
     const config = new DocumentBuilder()
-        .setTitle("HomeLand example")
+        .setTitle("")
         .setDescription("The HomeLand API description")
         .setVersion("1.0")

[Survived] StringLiteral
src/main.ts:36:25
 
     const config = new DocumentBuilder()
         .setTitle("HomeLand example")
-        .setDescription("The HomeLand API description")
+        .setDescription("")
         .setVersion("1.0")
         .addBearerAuth()

[Survived] ObjectLiteral
src/main.ts:41:44
         .addBearerAuth()
         .build();
 
-    const option: SwaggerDocumentOptions = {
-        deepScanRoutes: true,
-        extraModels: [Admin, Technician, Manager, Resident],
-    };
+    const option: SwaggerDocumentOptions = {};
     const document = SwaggerModule.createDocument(app, config, option);
 

[Survived] BooleanLiteral
src/main.ts:42:25
         .build();
 
     const option: SwaggerDocumentOptions = {
-        deepScanRoutes: true,
+        deepScanRoutes: false,
         extraModels: [Admin, Technician, Manager, Resident],
     };

[Survived] ObjectLiteral
src/main.ts:47:47
     };
     const document = SwaggerModule.createDocument(app, config, option);
 
-    SwaggerModule.setup("api", app, document, {
-        customCssUrl: "/style.css",
-        swaggerOptions: {
-            useUnsafeMarkdown: true,
-        },
-    });
+    SwaggerModule.setup("api", app, document, {});
 
     await app.listen(process.env.PORT || 3000);

[Survived] BooleanLiteral
src/main.ts:50:32
     SwaggerModule.setup("api", app, document, {
         customCssUrl: "/style.css",
         swaggerOptions: {
-            useUnsafeMarkdown: true,
+            useUnsafeMarkdown: false,
         },
     });
