[Killed] BlockStatement
src/seed/seed.service.ts:38:20
         
     ) {}
 
-    async dropDB() {
-        try {
-            await this.storageManager.destroyStorage();
-            await this.dataSource.dropDatabase();
-        } catch (error) {
-            throw new Error("error");
-            
-        }
-    }
+    async dropDB() {}
     async createDB() {
         try {
killedBy: SeedService should be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.

[Survived] BlockStatement
src/seed/seed.service.ts:39:13
     ) {}
 
     async dropDB() {
-        try {
-            await this.storageManager.destroyStorage();
-            await this.dataSource.dropDatabase();
-        } catch (error) {
+        try {} catch (error) {
             throw new Error("error");
             

[Killed] BlockStatement
src/seed/seed.service.ts:47:22
             
         }
     }
-    async createDB() {
-        try {
-            await this.storageManager.initiateStorage();
-            await this.dataSource.synchronize();
-        } catch (error) {
-            throw new Error("error");
-        }
-    }
+    async createDB() {}
     private readonly NUMBER_OF_BUILDING = 5;
     private readonly NUMBER_OF_FLOOR_PER_BUILDING = 5;
killedBy: AppController should be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.

[Timeout] ArrayDeclaration
src/seed/seed.service.ts:93:35
     async startSeeding() {
     }
     async createDemoApartments(floorInfo: any[]) {
-        let apartmentIds: any[] = [];
+        let apartmentIds: any[] = ["Stryker was here"];
         for (let floor of floorInfo) {
             for (let i = 0; i < this.NUMBER_OF_APARTMENT_PER_FLOOR; i++) {

[Killed] EqualityOperator
src/seed/seed.service.ts:95:29
     async createDemoApartments(floorInfo: any[]) {
         let apartmentIds: any[] = [];
         for (let floor of floorInfo) {
-            for (let i = 0; i < this.NUMBER_OF_APARTMENT_PER_FLOOR; i++) {
+            for (let i = 0; i >= this.NUMBER_OF_APARTMENT_PER_FLOOR; i++) {
                 apartmentIds.push(
                     (
killedBy: AppController should be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.

[Killed] UpdateOperator
src/seed/seed.service.ts:95:69
     async createDemoApartments(floorInfo: any[]) {
         let apartmentIds: any[] = [];
         for (let floor of floorInfo) {
-            for (let i = 0; i < this.NUMBER_OF_APARTMENT_PER_FLOOR; i++) {
+            for (let i = 0; i < this.NUMBER_OF_APARTMENT_PER_FLOOR; i--) {
                 apartmentIds.push(
                     (
killedBy: AppController should be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.
