[Timeout] ConditionalExpression
src/apartment/apartment.controller.ts:38:13
     })
     @Get()
     findAll(@Query("page") page: number) {
-        if (Number.isNaN(page)) return this.apartmentRepository.findAll();
+        if (true) return this.apartmentRepository.findAll();
         else return this.apartmentRepository.findAll(page);
     }

[Timeout] ConditionalExpression
src/apartment/apartment.controller.ts:38:13
     })
     @Get()
     findAll(@Query("page") page: number) {
-        if (Number.isNaN(page)) return this.apartmentRepository.findAll();
+        if (false) return this.apartmentRepository.findAll();
         else return this.apartmentRepository.findAll(page);
     }

[Timeout] BlockStatement
src/apartment/apartment.controller.ts:43:44
     }
 
     @Get(":id")
-    async findOne(@Param("id") id: string) {
-        const apartment = await this.apartmentRepository.findOne(id);
-        if (apartment) return apartment;
-        throw new NotFoundException("Apartment not found");
-    }
+    async findOne(@Param("id") id: string) {}
 
     /**

[Timeout] ConditionalExpression
src/apartment/apartment.controller.ts:45:13
     @Get(":id")
     async findOne(@Param("id") id: string) {
         const apartment = await this.apartmentRepository.findOne(id);
-        if (apartment) return apartment;
+        if (false) return apartment;
         throw new NotFoundException("Apartment not found");
     }

[Timeout] BlockStatement
src/apartment/apartment.controller.ts:61:7
     async update(
         @Param("id") id: string,
         @Body() updateApartmentDto: UpdateApartmentDto,
-    ) {
-        if (await this.apartmentRepository.update(id, updateApartmentDto)) {
-            return await this.findOne(id);
-        }
-    }
+    ) {}
 }
 

[Timeout] BlockStatement
src/apartment/apartment.controller.ts:62:76
         @Param("id") id: string,
         @Body() updateApartmentDto: UpdateApartmentDto,
     ) {
-        if (await this.apartmentRepository.update(id, updateApartmentDto)) {
-            return await this.findOne(id);
-        }
+        if (await this.apartmentRepository.update(id, updateApartmentDto)) {}
     }
 }

[Timeout] ConditionalExpression
src/apartment/apartment.controller.ts:62:13
         @Param("id") id: string,
         @Body() updateApartmentDto: UpdateApartmentDto,
     ) {
-        if (await this.apartmentRepository.update(id, updateApartmentDto)) {
+        if (true) {
             return await this.findOne(id);
         }
