[Killed] BlockStatement
src/building/building.controller.ts:28:58
     @ApiConsumes("multipart/form-data")
     @Post()
     @FormDataRequest()
-    create(@Body() createBuildingDto: CreateBuildingDto) {
-        return this.buildingRepository.create(createBuildingDto);
-    }
+    create(@Body() createBuildingDto: CreateBuildingDto) {}
     // search building
     /**
killedBy: BuildingController building should create new building
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"address": "996 Daugherty Extension", "building_id": Any<String>, "max_floor": 0, "name": "Building 3"}
Received: undefined

[Killed] BlockStatement
src/building/building.controller.ts:37:57
      * @param query string that admin search by name
      */
     @Get("search")
-    async searchBuilding(@Query("query") query: string) {
-        const result = await this.buildingRepository.search(query);
-        return result;
-    }
+    async searchBuilding(@Query("query") query: string) {}
     @ApiQuery({
         name: "page",
killedBy: AppController should be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.

[Killed] BlockStatement
src/building/building.controller.ts:53:13
     }
     @Get(":id")
     async findOne(@Param("id") id: string) {
-        try {
-            const building = await this.buildingRepository.findOne(id);
-            if (building) return building;
-        }
+        try {}
         catch(e) {
             throw new Error("Building not found");
killedBy: AppController should be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.

[Killed] ConditionalExpression
src/building/building.controller.ts:55:17
     async findOne(@Param("id") id: string) {
         try {
             const building = await this.buildingRepository.findOne(id);
-            if (building) return building;
+            if (false) return building;
         }
         catch(e) {
killedBy: BuildingController building should find building by id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"address": "996 Daugherty Extension", "building_id": "BLD3", "max_floor": 0, "name": "Building 3"}
Received: undefined

[Killed] StringLiteral
src/building/building.controller.ts:58:29
             if (building) return building;
         }
         catch(e) {
-            throw new Error("Building not found");
+            throw new Error("");
         }
         
killedBy: BuildingController building should not find building by id
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected message: "Building not found"
Received message: ""

      120 |         } else {
      121 |           stryCov_9fa48("281");
    > 122 |           throw new Error(stryMutAct_9fa48("282") ? "" : (stryCov_9fa48("282"), "Building not found"));

[Killed] BlockStatement
src/building/building.controller.ts:74:20
                 updateBuildingDto,
             );
             return result;
-        } catch(e) {
-            throw new Error("Building not found");
-
-        }
+        } catch(e) {}
     }
     @Delete("/:id")
killedBy: BuildingController building should update building fail because id not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
