[Killed] BlockStatement
src/contract/contract.controller.ts:43:48
             "Page number: Page indexed from 1, each page contain 30 items, if null then return all.",
     })
     @Get()
-   async findAll(@Query("page") page?: number) {
-        var data;
-        if (Number.isNaN(page)) data = await this.contractService.findAll();
-        else data = await this.contractService.findAll(page);
-        return { data, current_page: page, per_page: 30, total: data.length};
-    }
+   async findAll(@Query("page") page?: number) {}
 
     @Get(":id")
killedBy: ContractService get Contracts should find all contract
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"current_page": undefined, "data": {"apartment_id": "123", "contract_id": "CT001", "expire_at": 2030-01-01T00:00:00.000Z, "resident_id": "123", "role": "rent", "status": "inactive"}, "per_page": 30, "total": undefined}
Received: undefined

[Killed] ConditionalExpression
src/contract/contract.controller.ts:45:13
     @Get()
    async findAll(@Query("page") page?: number) {
         var data;
-        if (Number.isNaN(page)) data = await this.contractService.findAll();
+        if (true) data = await this.contractService.findAll();
         else data = await this.contractService.findAll(page);
         return { data, current_page: page, per_page: 30, total: data.length};
killedBy: ContractService get Contracts should find all contract with page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1
Received
       1: called with 0 arguments
       2: called with 0 arguments

Number of calls: 2

[Killed] BlockStatement
src/contract/contract.controller.ts:51:38
     }
 
     @Get(":id")
-    findOne(@Param("id") id: string) {
-        return this.contractService.findOne(id);
-    }
+    findOne(@Param("id") id: string) {}
 
     @Patch(":id")
killedBy: ContractService get Contracts should find contract by id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"apartment_id": "123", "contract_id": "CT001", "expire_at": 2030-01-01T00:00:00.000Z, "resident_id": "123", "role": "rent", "status": "inactive"}
Received: undefined
