[Killed] BlockStatement
src/seed/seed.controller.ts:16:22
     }
     @ApiOperation({ summary: "Init database" })
     @Post("/create")
-    async createDB() {
-        return await this.seedService.createDB();
-    }
+    async createDB() {}
     @ApiOperation({ summary: "Drop database" })
     @Delete("/drop")
killedBy: SeedService should be defined
statusReason: TypeError: Cannot destructure property 'resolve' of '__classPrivateFieldGet(...).shift(...)' as it is undefined.

[Killed] BlockStatement
src/seed/seed.controller.ts:21:20
     }
     @ApiOperation({ summary: "Drop database" })
     @Delete("/drop")
-    async dropDB() {
-        return await this.seedService.dropDB();
-    }
+    async dropDB() {}
 }
 
killedBy: SeedService Drop DB should drop DB
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"msg": "DB dropped"}
Received: undefined
