[Killed] StringLiteral
src/token/token.controller.ts:21:16
         description: "Token invalid or expired",
     })
     validateToken() {
-        return "Token is valid";
+        return "";
     }
 
killedBy: TokenService get Token should find Token by id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Token is valid"
Received: ""
