[Timeout] StringLiteral
src/helper/constant/index.ts:7:5
 export const hashRounds = 10;
 
 export const commonImageMIMETypes = [
-    "image/jpeg",
+    "",
     "image/png",
     "image/gif",

[Timeout] StringLiteral
src/helper/constant/index.ts:10:5
     "image/jpeg",
     "image/png",
     "image/gif",
-    "image/bmp",
+    "",
     "image/webp",
     "image/svg+xml",

[Timeout] StringLiteral
src/helper/constant/index.ts:11:5
     "image/png",
     "image/gif",
     "image/bmp",
-    "image/webp",
+    "",
     "image/svg+xml",
     "image/tiff",

[Timeout] StringLiteral
src/helper/constant/index.ts:12:5
     "image/gif",
     "image/bmp",
     "image/webp",
-    "image/svg+xml",
+    "",
     "image/tiff",
     "image/x-icon",

[Timeout] StringLiteral
src/helper/constant/index.ts:13:5
     "image/bmp",
     "image/webp",
     "image/svg+xml",
-    "image/tiff",
+    "",
     "image/x-icon",
     "image/vnd.microsoft.icon",

[Timeout] StringLiteral
src/helper/constant/index.ts:14:5
     "image/webp",
     "image/svg+xml",
     "image/tiff",
-    "image/x-icon",
+    "",
     "image/vnd.microsoft.icon",
     "image/vnd.wap.wbmp",
